## Module 1 Project

Please fill out:
* Student name: Jennifer Wadkins
* Student pace: self paced
* Scheduled project review date/time: 
* Instructor name: Jeff Herman
* Blog post URL:



Questions I have:
Do I need to justify not using provided data?

### Project Overview

### Importing our modules

We will be using the following libraries in this project:

pandas, numpy, matplotlib, json, re

In [347]:
import pandas as pd
import numpy as np
import matplotlib as plt
import json
import re
%matplotlib inline

### Other preparation work

Recommended to also install the nbextensions "Table of Contents 2" and "Collapsible Headings" for easier navigation through this notebook.

Gitbhub here: https://github.com/Jupyter-contrib/jupyter_nbextensions_configurator

## Source 1 -  The Numbers

In [348]:
# import movie budgets dataset from file
df1 = pd.read_csv('zippedData/tn.movie_budgets.csv')

### Exploring the Data

First we will look at our provided data set from "The Numbers" and see how it needs cleaning. When performing cleaning analysis on ALL datasets in this project, we initially want to know things like:
    * What is the shape of our imported data?
    * How many data entries?
    * What format is the data in?
    * How can we remove the most obvious redundancies (columns we just don't need, etc)
    * Are there missing/null values in the dataset that will need to be removed or imputed?

Before we work on this data set, we should check if we can get better/updated data from the source. We followed the Data link at "The Numbers" to https://www.opusdata.com/ and submitted a request for access to their data set. In the meantime we will contine to work with this data set as given.

In [349]:
# taking a look at what we've imported
df1.head(30)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"
10,11,"Jul 20, 2012",The Dark Knight Rises,"$275,000,000","$448,139,099","$1,084,439,099"
11,12,"May 25, 2018",Solo: A Star Wars Story,"$275,000,000","$213,767,512","$393,151,347"
12,13,"Jul 2, 2013",The Lone Ranger,"$275,000,000","$89,302,115","$260,002,115"
13,14,"Mar 9, 2012",John Carter,"$275,000,000","$73,058,679","$282,778,100"
14,15,"Nov 24, 2010",Tangled,"$260,000,000","$200,821,936","$586,477,240"
15,16,"May 4, 2007",Spider-Man 3,"$258,000,000","$336,530,303","$894,860,230"
16,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349","$1,140,069,413"
17,18,"Mar 25, 2016",Batman v Superman: Dawn of Justice,"$250,000,000","$330,360,194","$867,500,281"
18,19,"Dec 14, 2012",The Hobbit: An Unexpected Journey,"$250,000,000","$303,003,568","$1,017,003,568"
19,20,"Jul 15, 2009",Harry Potter and the Half-Blood Prince,"$250,000,000","$302,089,278","$935,213,767"
20,21,"Dec 13, 2013",The Hobbit: The Desolation of Smaug,"$250,000,000","$258,366,855","$960,366,855"
21,22,"Dec 17, 2014",The Hobbit: The Battle of the Five Armies,"$250,000,000","$255,119,788","$945,577,621"
22,23,"Apr 14, 2017",The Fate of the Furious,"$250,000,000","$225,764,765","$1,234,846,267"
23,24,"Jun 28, 2006",Superman Returns,"$232,000,000","$200,120,000","$374,085,065"
24,25,"May 26, 2017",Pirates of the Caribbean: Dead Men Tell No Tales,"$230,000,000","$172,558,876","$788,241,137"
25,26,"Nov 14, 2008",Quantum of Solace,"$230,000,000","$169,368,427","$591,692,078"
26,27,"May 4, 2012",The Avengers,"$225,000,000","$623,279,547","$1,517,935,897"
27,28,"Jul 7, 2006",Pirates of the Caribbean: Dead Manâs Chest,"$225,000,000","$423,315,812","$1,066,215,812"
28,29,"Jun 14, 2013",Man of Steel,"$225,000,000","$291,045,518","$667,999,518"
29,30,"May 16, 2008",The Chronicles of Narnia: Prince Caspian,"$225,000,000","$141,621,490","$417,341,288"

In [350]:
# what is the shape of our data?
df1.shape
# this data has 5782 entries

(5782, 6)

In [351]:
# what format is the data stored?
df1.dtypes
# We have a lot of data format problems here. Everything but the id is stored as an object,
# including the monetary numbers and the date. We will fix these problems during data cleanup.

id                    int64
release_date         object
movie                object
production_budget    object
domestic_gross       object
worldwide_gross      object
dtype: object

In [352]:
# do we have any missing/null values?
df1.isnull().sum()
# since we know that all of our data is objects, we MAY actually have missing values. We won't be sure until later.
# for now let's look at the tail of the set and see if anything pops out.

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [353]:
df1.tail()
# we do, in fact, see entries with a $0 for gross. These aren't showing up as null because
# they are actual entries rather than null values. We will need to remove or impute these entries after we convert these cells.

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

### Data Cleanup 

On the movie budgets dataset, we find the following things to clean up and resolve:
    * We have 5782 entries. We'll want to explore how/why movies were included in this dataset, as it's not a very large dataset compared to the number of movies released over time
    * all of the data in this set is objects. A lot of the data is numbers, so we need it to be in a numerical format
    * We have an id column, which can be used as our dataset index
    * Many entries with a $0 for gross. These aren't showing up as null in our initial EDA because they are actual entries of $0 not null values. We will need to remove these entries after we convert these cells.

We're going to clean up this dataset in the following way before moving on:

    1) set the id as the index
    2) convert the release date into a standard datetime
    3) convert all cost/gross fields into integers
    4) add 2 new columns for domestic net and worldwide net
    5) use regex to remove as many special characters from titles as possible, in hopes of matching this up with other data later
    6) remove rows without information for budget OR gross, as we won't be able to use this data

In [354]:
# block of cleanup actions performing actions 1-5 listed above

# use regex to remove all non-word characters
for ind in df1.index:
    text = str(df1['movie'][ind])
    result = re.sub(r"[,@\'?\.$%_:â()-]", "", text, flags=re.I)
    result = re.sub(r"\s+"," ", result, flags = re.I)
    df1['movie'][ind] = result

# sets the id as the index, removing a redundant column (former index)
df1.set_index('id', inplace=True)

# using pandas built-in datetime converter to change our release date column to standard format
df1['release_date'] = pd.to_datetime(df1['release_date'])

# write a function to convert the cost/gross object entries into proper numbers that we can use in calculation
def convert_numbers(x):
    '''Takes in a string formatted number that starts with $ and may include commas, and returns that 
    number as a whole integer that can be used in calculations'''
    x = x[1:]
    x = x.replace(',', '')
    x = int(x)
    return x

# run the function on each of our three cost/gross entries
df1['production_budget'] = df1['production_budget'].map(lambda x: convert_numbers(x))
df1['domestic_gross'] = df1['domestic_gross'].map(lambda x: convert_numbers(x))
df1['worldwide_gross'] = df1['worldwide_gross'].map(lambda x: convert_numbers(x))

# add two new columns for domestic net and worldwide net
df1['domestic_net'] = df1['domestic_gross'] - df1['production_budget']
df1['worldwide_net'] = df1['worldwide_gross'] - df1['production_budget']

C:\Users\Wadkins\anaconda3\envs\learn-env\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [355]:
# check that the data now looks the way we want it
df1.head(30)

,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
id,,,,,,,
1,2009-12-18,Avatar,425000000,760507625,2776345279,335507625,2351345279
2,2011-05-20,Pirates of the Caribbean On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875
3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650
4,2015-05-01,Avengers Age of Ultron,330600000,459005868,1403013963,128405868,1072413963
5,2017-12-15,Star Wars Ep VIII The Last Jedi,317000000,620181382,1316721747,303181382,999721747
6,2015-12-18,Star Wars Ep VII The Force Awakens,306000000,936662225,2053311220,630662225,1747311220
7,2018-04-27,Avengers Infinity War,300000000,678815482,2048134200,378815482,1748134200
8,2007-05-24,Pirates of the Caribbean At Worlds End,300000000,309420425,963420425,9420425,663420425
9,2017-11-17,Justice League,300000000,229024295,655945209,-70975705,355945209
10,2015-11-06,Spectre,300000000,200074175,879620923,-99925825,579620923
11,2012-07-20,The Dark Knight Rises,275000000,448139099,1084439099,173139099,809439099
12,2018-05-25,Solo A Star Wars Story,275000000,213767512,393151347,-61232488,118151347
13,2013-07-02,The Lone Ranger,275000000,89302115,260002115,-185697885,-14997885
14,2012-03-09,John Carter,275000000,73058679,282778100,-201941321,7778100
15,2010-11-24,Tangled,260000000,200821936,586477240,-59178064,326477240
16,2007-05-04,SpiderMan 3,258000000,336530303,894860230,78530303,636860230
17,2016-05-06,Captain America Civil War,250000000,408084349,1140069413,158084349,890069413
18,2016-03-25,Batman v Superman Dawn of Justice,250000000,330360194,867500281,80360194,617500281
19,2012-12-14,The Hobbit An Unexpected Journey,250000000,303003568,1017003568,53003568,767003568
20,2009-07-15,Harry Potter and the HalfBlood Prince,250000000,302089278,935213767,52089278,685213767
21,2013-12-13,The Hobbit The Desolation of Smaug,250000000,258366855,960366855,8366855,710366855
22,2014-12-17,The Hobbit The Battle of the Five Armies,250000000,255119788,945577621,5119788,695577621
23,2017-04-14,The Fate of the Furious,250000000,225764765,1234846267,-24235235,984846267
24,2006-06-28,Superman Returns,232000000,200120000,374085065,-31880000,142085065
25,2017-05-26,Pirates of the Caribbean Dead Men Tell No Tales,230000000,172558876,788241137,-57441124,558241137
26,2008-11-14,Quantum of Solace,230000000,169368427,591692078,-60631573,361692078
27,2012-05-04,The Avengers,225000000,623279547,1517935897,398279547,1292935897
28,2006-07-07,Pirates of the Caribbean Dead Mans Chest,225000000,423315812,1066215812,198315812,841215812
29,2013-06-14,Man of Steel,225000000,291045518,667999518,66045518,442999518
30,2008-05-16,The Chronicles of Narnia Prince Caspian,225000000,141621490,417341288,-83378510,192341288

Now that we have corrected our numbers, we need to address the missing data that we identified before. We also want to figure out how the movies were selected for inclusion on this list, if possible, as it's clearly a small sample of all available released movies.

In [356]:
sum(df1['production_budget'] == 0)
# all of the movies have a production budget listed. Regardless, we can't get enough info about success without any gross, so
# we'll be dropping the rows that have a gross of 0 for domestic

0

In [357]:
sum(df1['domestic_gross'] == 0)
# 548 of our entries have no data for domestic_gross. We can't use these in calculations, and we're not going
# to impute them, so we are going to drop these rows from the dataset.

548

In [358]:
df1 = df1[df1['domestic_gross'] !=0]
# dropping all rows where there is no domestic gross information
df1

,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
id,,,,,,,
1,2009-12-18,Avatar,425000000,760507625,2776345279,335507625,2351345279
2,2011-05-20,Pirates of the Caribbean On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875
3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650
4,2015-05-01,Avengers Age of Ultron,330600000,459005868,1403013963,128405868,1072413963
5,2017-12-15,Star Wars Ep VIII The Last Jedi,317000000,620181382,1316721747,303181382,999721747
...,...,...,...,...,...,...,...
76,2006-05-26,Cavite,7000,70071,71644,63071,64644
77,2004-12-31,The Mongol King,7000,900,900,-6100,-6100
79,1999-04-02,Following,6000,48482,240495,42482,234495
80,2005-07-13,Return to the Land of Wonders,5000,1338,1338,-3662,-3662
82,2005-08-05,My Date With Drew,1100,181041,181041,179941,179941

In [359]:
# Setting the movie title as the index
df1.set_index('movie', inplace=True)

We're still not sure how movies were chosen for this particular dataset, but at least we've cleaned up the data. We no longer have any movies in the set without a budget, gross and net information. All of our dates are in a standard format, and all of our money entries are in an integer format so that we can do further calculations with them.

### Further Analysis

We're now happy with our cleanup. Time to look deeper into the info our data gives us. Namely, what appears to be the stats that warranted inclusion on this list?

In [360]:
df1.sort_values('worldwide_net', ascending=False)
# our net ranges from positive to negative, so it's not just top grossing movies

,release_date,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
movie,,,,,,
Avatar,2009-12-18,425000000,760507625,2776345279,335507625,2351345279
Titanic,1997-12-19,200000000,659363944,2208208395,459363944,2008208395
Avengers Infinity War,2018-04-27,300000000,678815482,2048134200,378815482,1748134200
Star Wars Ep VII The Force Awakens,2015-12-18,306000000,936662225,2053311220,630662225,1747311220
Jurassic World,2015-06-12,215000000,652270625,1648854864,437270625,1433854864
...,...,...,...,...,...,...
The Adventures of Pluto Nash,2002-08-16,100000000,4411102,7094995,-95588898,-92905005
Town & Country,2001-04-27,105000000,6712451,10364769,-98287549,-94635231
Men in Black International,2019-06-14,110000000,3100000,3100000,-106900000,-106900000
Mars Needs Moms,2011-03-11,150000000,21392758,39549758,-128607242,-110450242
Dark Phoenix,2019-06-07,350000000,42762350,149762350,-307237650,-200237650

In [361]:
df1.sort_values('release_date', ascending=False)
# our release dates cover the gamut of 1915-2020, so it's not just movies within the last x years

,release_date,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
movie,,,,,,
Shaft,2019-06-14,30000000,600000,600000,-29400000,-29400000
Men in Black International,2019-06-14,110000000,3100000,3100000,-106900000,-106900000
Dark Phoenix,2019-06-07,350000000,42762350,149762350,-307237650,-200237650
Late Night,2019-06-07,4000000,246305,246305,-3753695,-3753695
The Secret Life of Pets 2,2019-06-07,80000000,63795655,113351496,-16204345,33351496
...,...,...,...,...,...,...
BenHur A Tale of the Christ,1925-12-30,3900000,9000000,9000000,5100000,5100000
The Big Parade,1925-11-19,245000,11000000,22000000,10755000,21755000
Over the Hill to the Poorhouse,1920-09-17,100000,3000000,3000000,2900000,2900000
20000 Leagues Under the Sea,1916-12-24,200000,8000000,8000000,7800000,7800000
The Birth of a Nation,1915-02-08,110000,10000000,11000000,9890000,10890000

In [362]:
df1.sort_values('production_budget')
# production budget was clearly not a minimum requirement, as our budgets range from only a few thousand dollars
# to over 400 million dollars

,release_date,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
movie,,,,,,
My Date With Drew,2005-08-05,1100,181041,181041,179941,179941
Return to the Land of Wonders,2005-07-13,5000,1338,1338,-3662,-3662
Following,1999-04-02,6000,48482,240495,42482,234495
El Mariachi,1993-02-26,7000,2040920,2041928,2033920,2034928
The Mongol King,2004-12-31,7000,900,900,-6100,-6100
...,...,...,...,...,...,...
Star Wars Ep VIII The Last Jedi,2017-12-15,317000000,620181382,1316721747,303181382,999721747
Avengers Age of Ultron,2015-05-01,330600000,459005868,1403013963,128405868,1072413963
Dark Phoenix,2019-06-07,350000000,42762350,149762350,-307237650,-200237650
Pirates of the Caribbean On Stranger Tides,2011-05-20,410600000,241063875,1045663875,-169536125,635063875
Avatar,2009-12-18,425000000,760507625,2776345279,335507625,2351345279

In [363]:
#pd.plotting.scatter_matrix(df1[['production_budget', 'domestic_net', 'worldwide_net']], figsize=(15,15));

In [364]:
#df1.plot('release_date', 'domestic_net', kind='scatter', figsize=(10, 10));

### Data Cleanup - Round 2

Now that we're looking at some visualizations, we realize that this data goes back further than we really need. We're not aiming for the full history of cinema - we're aiming to capitalize on current trends and provide current recommendations. With this in mind, we will lose all entries that are more than 20 years old.

In [365]:
df1['before_2000'] = df1['release_date'] >= pd.to_datetime('2000-01-01')
df1 = df1[df1['before_2000'] != False]
df1.drop(columns='before_2000', inplace=True)
df1

C:\Users\Wadkins\anaconda3\envs\learn-env\lib\site-packages\pandas\core\frame.py:4167: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

,release_date,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
movie,,,,,,
Avatar,2009-12-18,425000000,760507625,2776345279,335507625,2351345279
Pirates of the Caribbean On Stranger Tides,2011-05-20,410600000,241063875,1045663875,-169536125,635063875
Dark Phoenix,2019-06-07,350000000,42762350,149762350,-307237650,-200237650
Avengers Age of Ultron,2015-05-01,330600000,459005868,1403013963,128405868,1072413963
Star Wars Ep VIII The Last Jedi,2017-12-15,317000000,620181382,1316721747,303181382,999721747
...,...,...,...,...,...,...
Primer,2004-10-08,7000,424760,841926,417760,834926
Cavite,2006-05-26,7000,70071,71644,63071,64644
The Mongol King,2004-12-31,7000,900,900,-6100,-6100
Return to the Land of Wonders,2005-07-13,5000,1338,1338,-3662,-3662
My Date With Drew,2005-08-05,1100,181041,181041,179941,179941

## Source 2 - The Movie Database

Time to work with data from a different source. We're using information from TMDB - The Movie Database

### Exploring the Data

We're going to perform our cleanup analysis on this dataset, including:
    * What is the shape of our imported data?
    * How many data entries?
    * What format is the data in?
    * How can we remove the most obvious redundancies (columns we just don't need, etc)
    * Are there missing/null values in the dataset that will need to be removed or imputed?

In [366]:
# importing the movie database movies data set from file
df2 = pd.read_csv('zippedData/tmdb.movies.csv')

In [367]:
# taking a look at what we've imported
df2.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [368]:
# what is the shape of our data?
df2.shape
# this dataset has 26,517 movie entries

(26517, 10)

In [369]:
# what kind of data is stored?
df2.dtypes
# Most of the data in this set seems to be stored in the correct format already (numbers as numbers, etc)
# we'll change the date to a proper date/time

Unnamed: 0             int64
genre_ids             object
id                     int64
original_language     object
original_title        object
popularity           float64
release_date          object
title                 object
vote_average         float64
vote_count             int64
dtype: object

In [370]:
# do we have any missing/null values?
df2.isnull().sum()
# This dataset has no missing values. That doesn't mean there aren't categorical placeholders, and we will look into that further

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [371]:
df2.describe()
# One thing we can see in this dataset is that there are a LOT of movies with 5 or fewer votes. A full 50% of the dataset
# has 5 or fewer votes. The difference between or 75th percentile and the max goes from 28 to 22,000 votes!!
# We will look more into this and figure out the situation.

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

In [372]:
df2['vote_count'].value_counts()
# There are 6541 entries in this dataset with only 1 vote. We're going to look at these entries later and figure out what is
# unusual about them.

1       6541
2       3044
3       1757
4       1347
5        969
        ...
2328       1
6538       1
489        1
2600       1
2049       1
Name: vote_count, Length: 1693, dtype: int64

In [373]:
df2.sort_values('popularity').head()
# while sorting on popularity, I also notice for the first time that a lot of the genre_ids on this low popularity list are absent

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
13258,13258,[99],403294,en,9/11: Simulations,0.6,2014-07-04,9/11: Simulations,10.0,1
11010,11010,[],203325,en,Slaves Body,0.6,2013-06-25,Slaves Body,0.5,1
11011,11011,[99],186242,en,Re-Emerging: The Jews of Nigeria,0.6,2013-05-17,Re-Emerging: The Jews of Nigeria,0.5,2
11012,11012,[99],116868,en,Occupation: Fighter,0.6,2013-08-02,Occupation: Fighter,0.5,2
11013,11013,[99],85337,en,Wonders Are Many: The Making of Doctor Atomic,0.6,2013-08-07,Wonders Are Many: The Making of Doctor Atomic,0.5,2

In [374]:
df2[(df2['vote_count'] > 30)].count()
# we only have 6347 entries in this dataset with more than 30 user votes. I question the quality of this dataset.
# Overall, this might just not be great data, and since we have access to a TMDB API, we may decide to pull better data
# ourselves

Unnamed: 0           6347
genre_ids            6347
id                   6347
original_language    6347
original_title       6347
popularity           6347
release_date         6347
title                6347
vote_average         6347
vote_count           6347
dtype: int64

### Pulling Data from TMDB via API

Before we take time to clean up the data set we have, we're going to take a look at the TMDB API and see if we can pull more or better information first!

We're going to pull the data that we want to use from TMDB using an API key. Looking a little further into the other data sets we are using, we can see some interesting options with the TMDB API that want to add to our data including:
    * Movie genre list to match up with the genre-ids (under Genres)
    * More up-to-date dataset in general, retrieved with some predetermined data refinement critera 
    * A list of the IMDB movie ids, which will be incredibly helpful for us to join this TMDB info with our IMDB info later in the notebook (under Movies -> Get External IDs)
    
We're accessing the API documentation for TMDB at https://developers.themoviedb.org/3/getting-started/introduction, after registering for an API key.

#### Discover Movie Data Set

The big workhorse API call for TMDB is in "Discover" located at https://developers.themoviedb.org/3/discover/movie-discover

In this section we can get back a data set that can, in some ways, be pre-cleaned. So we are going to determine how we plan to refine/clean our data set right now, and then figure out ways that we can pull data from TMDB that already fits the parameters we want.

Here are the data cleanup steps we are planning for our data set, some of which can be achieved while we grab the data:

    * Drop entries with fewer than 30 votes. Our client is looking for a blockbuster, not a bespoke production.
    * Drop entries with no genre specified. We'll want to use the genre to make recommendations.
    * Drop entries with 1.0 or less popularity, for the same reasons as votes
    * Drop movies older than 2010. This is as far back as our IMDB set goes, and we'd like to match up our data.
    * Set the index as the Unnamed column
    
The Discover API lets us pass the following useful parameters to fulfill some of our data refinement goals:
    * primary_release_date.gte lets us include movies that have a primary release date greater or equal than the specified value
    * primary_release_date.lte lets us keep our scope in 2019 or newer for purposes of our case study. We're looking at movie production in a pre-covid world.
    * vote_count.gte lets us filter for movies with a vote count greater than or equal to the specified value
    * with_original_language lets us pull english language films. Our client will be making films in english

This will take care of a few of the things we wanted to clean up in our dataset.
 
We're getting this and other API data in a separate notebook, because we don't want to make these API calls every time we run this notebook! We've pulled the data via the notebook called "tmdb_api_calls" and saved those as JSON files, and will now import our JSON files here for further processing.

!!! STOP !!! Go to the notebook at tmdb_api_calls.ipynb and run the first section now.

In [375]:
# opening up our Discover dataset

f = open('api_data/tmdb_movies.json', encoding='utf-8')
discover = json.load(f)

type(discover) # we've loaded our Discover dataset and it's a dictionary

dict

In [376]:
discover.keys() # checking the keys
# we ran our function to paginate in the API and as a result, our keys are each of the 500 calls we made to the api. We'll
# need to go a level lower to hit our data.

dict_keys(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93', '94', '95', '96', '97', '98', '99', '100', '101', '102', '103', '104', '105', '106', '107', '108', '109', '110', '111', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122', '123', '124', '125', '126', '127', '128', '129', '130', '131', '132', '133', '134', '135', '136', '137', '138', '139', '140', '141', '142', '143', '144', '145', '146', '147', '148', '149', '150', '151', '152', '153', '154', '155', '156', '157', '158', '159', '160', '161', '162', '163', '164', '165', '166', '167', '168', '169', '170', '171', '172', '173', '174', '175', '176', '177', '178', '179', '180', '181', '182', '183', '184', '185', '186', '187', '188', '189', '190', '191', '192', '193', '194', '195', '196', '197', '198', '199', '200', '201', '202', '203', '204', '205', '206', '207', '208', '209', '210', '211', '212', '213', '214', '215', '216', '217', '218', '219', '220', '221', '222', '223', '224', '225', '226', '227', '228', '229', '230', '231', '232', '233', '234', '235', '236', '237', '238', '239', '240', '241', '242', '243', '244', '245', '246', '247', '248', '249', '250', '251', '252', '253', '254', '255', '256', '257', '258', '259', '260', '261', '262', '263', '264', '265', '266', '267', '268', '269', '270', '271', '272', '273', '274', '275', '276', '277', '278', '279', '280', '281', '282', '283', '284', '285', '286', '287', '288', '289', '290', '291', '292', '293', '294', '295', '296', '297', '298', '299', '300', '301', '302', '303', '304', '305', '306', '307', '308', '309', '310', '311', '312', '313', '314', '315', '316', '317', '318', '319', '320', '321', '322', '323', '324', '325', '326', '327', '328', '329', '330', '331', '332', '333', '334', '335', '336', '337', '338', '339', '340', '341', '342', '343', '344', '345', '346', '347', '348', '349', '350', '351', '352', '353', '354', '355', '356', '357', '358', '359', '360', '361', '362', '363', '364', '365', '366', '367', '368', '369', '370', '371', '372', '373', '374', '375', '376', '377', '378', '379', '380', '381', '382', '383', '384', '385', '386', '387', '388', '389', '390', '391', '392', '393', '394', '395', '396', '397', '398', '399', '400', '401', '402', '403', '404', '405', '406', '407', '408', '409', '410', '411', '412', '413', '414', '415', '416', '417', '418', '419', '420', '421', '422', '423', '424', '425', '426', '427', '428', '429', '430', '431', '432', '433', '434', '435', '436', '437', '438', '439', '440', '441', '442', '443', '444', '445', '446', '447', '448', '449', '450', '451', '452', '453', '454', '455', '456', '457', '458', '459', '460', '461', '462', '463', '464', '465', '466', '467', '468', '469', '470', '471', '472', '473', '474', '475', '476', '477', '478', '479', '480', '481', '482', '483', '484', '485', '486', '487', '488', '489', '490', '491', '492', '493', '494', '495', '496', '497', '498', '499', '500'])

In [377]:
# what does the first level of our dictionary look like?
discover['1']
# This is page 1 of the results

discover['1']['results']
# these are the entries on page 1. Our plan now is to write a function to iterate through the pages, and concatenate the 
# results onto a pandas dataframe

[{'popularity': 823.042,
  'vote_count': 12617,
  'video': False,
  'poster_path': '/gGEsBPAijhVUFoiNpgZXqRVWJt2.jpg',
  'id': 354912,
  'adult': False,
  'backdrop_path': '/askg3SMvhqEl4OL52YuvdtY40Yb.jpg',
  'original_language': 'en',
  'original_title': 'Coco',
  'genre_ids': [16, 10751, 35, 12, 14, 10402],
  'title': 'Coco',
  'vote_average': 8.2,
  'overview': "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
  'release_date': '2017-10-27'},
 {'popularity': 356.048,
  'vote_count': 5124,
  'video': False,
  'poster_path': '/zfE0R94v1E8cuKAerbskfD3VfUt.jpg',
  'id': 474350,
  'adult': False,
  'backdrop_path': '/8moTOzunF7p40oR5XhlDvJckOSW.jpg',
  'original_language': 'en',
  'original_title': 'It Chapter Two',
  'genre_ids': [27, 14],
  'title': 'It Chapter Two',
  'vote_average': 6.9,
  'overview': "27 years after overcoming the malevolent supernatural entity Pennywise, the former members of the Losers' Club, who have grown up and moved away from Derry, are brought back together by a devastating phone call.",
  'release_date': '2019-09-04'},
 {'popularity': 333.745,
  'vote_count': 15365,
  'video': False,
  'poster_path': '/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg',
  'id': 475557,
  'adult': False,
  'backdrop_path': '/n6bUvigpRFqSwmPp1m2YADdbRBc.jpg',
  'original_language': 'en',
  'original_title': 'Joker',
  'genre_ids': [80, 53, 18],
  'title': 'Joker',
  'vote_average': 8.2,
  'overview': 'During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.',
  'release_date': '2019-10-02'},
 {'popularity': 279.613,
  'vote_count': 6340,
  'video': False,
  'poster_path': '/qXsndsv3WOoxszmdlvTWeY688eK.jpg',
  'id': 330457,
  'adult': False,
  'backdrop_path': '/xJWPZIYOEFIjZpBL7SVBGnzRYXp.jpg',
  'original_language': 'en',
  'original_title': 'Frozen II',
  'genre_ids': [16, 10751, 12, 35, 14],
  'title': 'Frozen II',
  'vote_average': 7.3,
  'overview': 'Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.',
  'release_date': '2019-11-20'},
 {'popularity': 204.021,
  'vote_count': 3720,
  'video': False,
  'poster_path': '/ubLbY97m8lYJ3Fykh7nfiwB5eth.jpg',
  'id': 316727,
  'adult': False,
  'backdrop_path': '/craD86vySKvAkboyeXFnZwHrNA8.jpg',
  'original_language': 'en',
  'original_title': 'The Purge: Election Year',
  'genre_ids': [28, 27, 53],
  'title': 'The Purge: Election Year',
  'vote_average': 6.4,
  'overview': 'Two years after choosing not to kill the man who killed his son, former police sergeant Leo Barnes has become head of security for Senator Charlene Roan, the front runner in the next Presidential election due to her vow to eliminate the Purge. On the night of what should be the final Purge, a betrayal from within the government forces Barnes and Roan out onto the street where they must fight to survive the night.',
  'release_date': '2016-06-29'},
 {'popularity': 231.535,
  'vote_count': 4922,
  'video': False,
  'poster_path': '/jyw8VKYEiM1UDzPB7NsisUgBeJ8.jpg',
  'id': 512200,
  'adult': False,
  'backdrop_path': '/zTxHf9iIOCqRbxvl8W5QYKrsMLq.jpg',
  'original_language': 'en',
  'original_title': 'Jumanji: The Next Level',
  'genre_ids': [12, 35, 14],
  'title': 'Jumanji: The Next Level',
  'vote_average': 7,
  'overview': 'As the gang return to Jumanji to rescue one of their own, they discover that nothing is as they expect. The players will have to brave parts unknown and unexplored in order to escape the world’s most dangerous game.',
  'release_date': '2019-12-04'},
 {'popularity': 202.211,
  'vote_count': 20049,
  'video': False,
  'poster_path': '/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg',
  'id': 299536,
  'adult': False,
  'backdrop_path': '/lmZFxXgJE3vgrciwuDib0N8CfQo.jpg',
  'original_language': 'en',
  'original_title': 'Avengers: Infinity War',
  'genre_ids': [12, 28, 878],
  'title': 'Avengers: Infinity War',
  'vote_average': 8.3,
  'overview': 'As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.',
  'release_date': '2018-04-25'},
 {'popularity': 210.977,
  'vote_count': 96,
  'video': False,
  'poster_path': '/dp1brl24LXGFU3JPFaDoljDONRz.jpg',
  'id': 640882,
  'adult': False,
  'backdrop_path': '/3xe3RUDpdrD9XCzgdlpUFgwIX0z.jpg',
  'original_language': 'en',
  'original_title': '3022',
  'genre_ids': [878],
  'title': '3022',
  'vote_average': 5.7,
  'overview': 'A group of astronauts living in the haunting emptiness of deep space awakens to find earth has suffered an extinction-level event.',
  'release_date': '2019-11-22'},
 {'popularity': 241.933,
  'id': 384018,
  'video': False,
  'vote_count': 4281,
  'vote_average': 6.9,
  'title': 'Fast & Furious Presents: Hobbs & Shaw',
  'release_date': '2019-08-01',
  'original_language': 'en',
  'original_title': 'Fast & Furious Presents: Hobbs & Shaw',
  'genre_ids': [28, 12, 35],
  'backdrop_path': '/qAhedRxRYWZAgZ8O8pHIl6QHdD7.jpg',
  'adult': False,
  'overview': "Ever since US Diplomatic Security Service Agent Hobbs and lawless outcast Shaw first faced off, they just have swapped smacks and bad words. But when cyber-genetically enhanced anarchist Brixton's ruthless actions threaten the future of humanity, both join forces to defeat him. (A spin-off of “The Fate of the Furious,” focusing on Johnson's Luke Hobbs and Statham's Deckard Shaw.)",
  'poster_path': '/qRyy2UmjC5ur9bDi3kpNNRCc5nc.jpg'},
 {'popularity': 192.591,
  'id': 420634,
  'video': False,
  'vote_count': 298,
  'vote_average': 6.3,
  'title': 'Terrifier',
  'release_date': '2016-10-15',
  'original_language': 'en',
  'original_title': 'Terrifier',
  'genre_ids': [53, 27],
  'backdrop_path': '/fBNnj5bQ5YhzPUzxIW1UvLVZepP.jpg',
  'adult': False,
  'overview': 'A maniacal clown named Art terrorizes three young women and everyone else who stands in his way on Halloween night.',
  'poster_path': '/4lwh4MX2yCogHflyAYMRbfdnpnm.jpg'},
 {'popularity': 197.853,
  'id': 442249,
  'video': False,
  'vote_count': 2639,
  'vote_average': 5.9,
  'title': 'The First Purge',
  'release_date': '2018-07-04',
  'original_language': 'en',
  'original_title': 'The First Purge',
  'genre_ids': [28, 878, 53, 27],
  'backdrop_path': '/r4clWIxKeWoqrHspQP0XunuUmB7.jpg',
  'adult': False,
  'overview': 'To push the crime rate below one percent for the rest of the year, the New Founding Fathers of America test a sociological theory that vents aggression for one night in one isolated community. But when the violence of oppressors meets the rage of the others, the contagion will explode from the trial-city borders and spread across the nation.',
  'poster_path': '/litjsBoiydO6JlO70uOX4N3WnNL.jpg'},
 {'popularity': 188.406,
  'vote_count': 6824,
  'video': False,
  'poster_path': '/iZf0KyrE25z1sage4SYFLCCrMi9.jpg',
  'id': 530915,
  'adult': False,
  'backdrop_path': '/cqa3sa4c4jevgnEJwq3CMF8UfTG.jpg',
  'original_language': 'en',
  'original_title': '1917',
  'genre_ids': [10752, 18],
  'title': '1917',
  'vote_average': 7.9,
  'overview': 'At the height of the First World War, two young British soldiers must cross enemy territory and deliver a message that will stop a deadly attack on hundreds of soldiers.',
  'release_date': '2019-12-25'},
 {'popularity': 187.627,
  'vote_count': 15521,
  'video': False,
  'poster_path': '/or06FN3Dka5tukK1e9sl16pB3iy.jpg',
  'id': 299534,
  'adult': False,
  'backdrop_path': '/orjiB3oUIsyz60hoEqkiGpy5CeO.jpg',
  'original_language': 'en',
  'original_title': 'Avengers: Endgame',
  'genre_ids': [12, 878, 28],
  'title': 'Avengers: Endgame',
  'vote_average': 8.3,
  'overview': "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
  'release_date': '2019-04-24'},
 {'popularity': 173.129,
  'vote_count': 337,
  'video': False,
  'poster_path': '/dBSEA6P2bq7apsmORxV0a54puhL.jpg',
  'id': 87436,
  'adult': False,
  'backdrop_path': '/633VU2W1jOs8WLcZXyE2gnjk84W.jpg',
  'original_language': 'en',
  'original_title': 'The ABCs of Death',
  'genre_ids': [27],
  'title': 'The ABCs of Death',
  'vote_average': 4.8,
  'overview': "An ambitious anthology film featuring segments directed by over two dozen of the world's leading talents in contemporary genre film. Inspired by children's educational ABC books, the film comprises 26 individual chapters, each helmed by a different director assigned a letter of the alphabet. The directors were then given free reign in choosing a word to create a story involving death.",
  'release_date': '2013-03-08'},
 {'popularity': 182.415,
  'vote_count': 6982,
  'video': False,
  'poster_path': '/dzBtMocZuJbjLOXvrl4zGYigDzh.jpg',
  'id': 420818,
  'adult': False,
  'backdrop_path': '/nRXO2SnOA75OsWhNhXstHB8ZmI3.jpg',
  'original_language': 'en',
  'original_title': 'The Lion King',
  'genre_ids': [12, 10751, 10402],
  'title': 'The Lion King',
  'vote_average': 7.2,
  'overview': "Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his.",
  'release_date': '2019-07-12'},
 {'popularity': 173.739,
  'vote_count': 6111,
  'video': False,
  'poster_path': '/29Qf0zH2pF1YKBxWJIcSvS6ubJq.jpg',
  'id': 158015,
  'adult': False,
  'backdrop_path': '/tZ0A51DX5UKJbpa15RX0FyduVQT.jpg',
  'original_language': 'en',
  'original_title': 'The Purge',
  'genre_ids': [878, 27, 53],
  'title': 'The Purge',
  'vote_average': 6.2,
  'overview': "Given the country's overcrowded prisons, the U.S. government begins to allow 12-hour periods of time in which all illegal activity is legal. During one of these free-for-alls, a family must protect themselves from a home invasion.",
  'release_date': '2013-05-31'},
 {'popularity': 210.407,
  'vote_count': 121,
  'video': False,
  'poster_path': '/rfItXrtDGILwsCdmgVxX79phFuI.jpg',
  'id': 440249,
  'adult': False,
  'backdrop_path': '/uO6ZUez70Twan92pqoV60T9kiGH.jpg',
  'original_language': 'en',
  'original_title': 'After Porn Ends 2',
  'genre_ids': [99],
  'title': 'After Porn Ends 2',
  'vote_average': 5,
  'overview': "After Porn Ends 2 picks up where its predecessor left off and not only turns back the clock to meet the oldest living stars in adult film's history, but goes in depth with some of Its most current retirees and juxtaposes their experiences in a life after porn. Delving deeper into society's ongoing stigmas of race, misogyny, and the reality of decreasing opportunities for these former VHS box cover stars. For some, their careers in adult entertainment is accepted proudly and without regret. In fact, it seems to have proven to be the pathway to their current happiness and inner peace. For others, however, a career in porn has proven to be a conduit to certain despair as they struggle to find a way to bury their past and emerge with a new career or calling.",
  'release_date': '2017-03-28'},
 {'popularity': 177.346,
  'vote_count': 8588,
  'video': False,
  'poster_path': '/4q2NNj4S5dG2RLF9CpXsej7yXl.jpg',
  'id': 429617,
  'adult': False,
  'backdrop_path': '/5myQbDzw3l8K9yofUXRJ4UTVgam.jpg',
  'original_language': 'en',
  'original_title': 'Spider-Man: Far from Home',
  'genre_ids': [28, 12, 878],
  'title': 'Spider-Man: Far from Home',
  'vote_average': 7.6,
  'overview': 'Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.',
  'release_date': '2019-06-28'},
 {'popularity': 174.398,
  'vote_count': 1217,
  'video': False,
  'poster_path': '/q1epO0eO8DWu8Vo8tPfvVlzW48T.jpg',
  'id': 481084,
  'adult': False,
  'backdrop_path': '/ur4NTeFGZmQ6Hz5uEkAMgPI3WRg.jpg',
  'original_language': 'en',
  'original_title': 'The Addams Family',
  'genre_ids': [16, 35, 10751, 14],
  'title': 'The Addams Family',
  'vote_average': 6.6,
  'overview': "The Addams family's lives begin to unravel when they face-off against a treacherous, greedy crafty reality-TV host while also preparing for their extended family to arrive for a major celebration.",
  'release_date': '2019-10-10'},
 {'popularity': 182.592,
  'vote_count': 3778,
  'video': False,
  'poster_path': '/vloNTScJ3w7jwNwtNGoG8DbTThv.jpg',
  'id': 420809,
  'adult': False,
  'backdrop_path': '/skvI4rYFrKXS73BJxWGH54Omlvv.jpg',
  'original_language': 'en',
  'original_title': 'Maleficent: Mistress of Evil',
  'genre_ids': [14, 10751, 12],
  'title': 'Maleficent: Mistress of Evil',
  'vote_average': 7.4,
  'overview': 'Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies, and dark new forces at play.',
  'release_date': '2019-10-16'}]

In [378]:
tmdb_discover = pd.DataFrame() #start by making an empty dataframe to hold our results

# loop through each page of our response JSON, make it into a dataframe, and concatenate onto our big dataframe
for x in discover:
    df = pd.DataFrame.from_dict(discover[x]['results'])
    tmdb_discover = pd.concat([tmdb_discover, df])

tmdb_discover.tail() #finished dataframe

,popularity,vote_count,video,poster_path,id,adult,backdrop_path,original_language,original_title,genre_ids,title,vote_average,overview,release_date
2,0.6,40,False,/b6BzZuNv8YNePhuzrA5yKxbGb2H.jpg,184712,False,None,en,Battledogs,"[28, 27, 878]",Battledogs,5.0,When a strange werewolf virus threatens to dec...,2013-04-05
3,0.6,322,False,/f4fR1WMgSv7K93ZPoJlPyvaApdE.jpg,174323,False,/xMI50FAfPOLwUQ0uKM3u3EmFeHc.jpg,en,G.B.F.,"[35, 18]",G.B.F.,5.9,The bitter fight for supremacy between the thr...,2013-10-20
4,0.6,41,False,/f0g2nInIU1MU74wP7av3AvxzSBB.jpg,173455,False,None,en,Mistaken for Strangers,"[99, 10402]",Mistaken for Strangers,7.2,Mistaken for Strangers follows The National on...,2013-09-19
5,0.6,37,False,/xYW9kuRPpkumbyOK3znajiKNEQu.jpg,136568,False,None,en,Dragon Wasps,"[28, 878]",Dragon Wasps,5.0,A scientist enlists the help of the US army to...,2012-09-17
6,0.6,67,False,/jR23RdlMY8sYP3oWSmCz5DaZ2ok.jpg,110393,False,/y9baxnmtffNzIdBPBhxzTruvBRo.jpg,en,Elefante blanco,[18],White Elephant,6.6,"The ""Villa Virgin"", a shantytown in the slums ...",2012-05-16

One important thing that we notice here is that even filtering for <20 years old, 31+ votes, english language films, and all of our other preliminary data refinement, we have still hit the 10,000 return maximum using this API. Because of this, we are definitely going to use this data instead of the provided TMDB dataset, because we know that we have at least 10,000 entries of quality data instead of around 6,000 (and actually less, as we never filtered the original set for within 20 years).

### Exploring the Data - Part 2

In [379]:
tmdb_discover.shape
# we have 6,467 entries

(6467, 14)

In [380]:
tmdb_discover.dtypes
# we'll take a look at fixing the release_date format and converting that to a proper datetime. Everything else looks correct.

popularity           float64
vote_count             int64
video                   bool
poster_path           object
id                     int64
adult                   bool
backdrop_path         object
original_language     object
original_title        object
genre_ids             object
title                 object
vote_average         float64
overview              object
release_date          object
dtype: object

In [381]:
tmdb_discover.describe()
# we can see that we have meaningful data with a reasonable vote_count per entry and high popularity

        popularity    vote_count             id  vote_average
count  6467.000000   6467.000000    6467.000000   6467.000000
mean     16.882259    875.385959  278345.921911      6.144054
std      22.396100   2130.704551  162710.319403      0.968545
min       0.600000     31.000000     189.000000      1.500000
25%       7.991000     55.000000  118476.000000      5.500000
50%      10.977000    133.000000  290542.000000      6.200000
75%      17.525500    585.000000  410835.000000      6.800000
max     823.042000  27499.000000  704264.000000      9.000000

In [382]:
tmdb_discover[(tmdb_discover['genre_ids'] == '[]')].count()
# All of our entries have genre ids. That is very important for our recommendations!

popularity           0
vote_count           0
video                0
poster_path          0
id                   0
adult                0
backdrop_path        0
original_language    0
original_title       0
genre_ids            0
title                0
vote_average         0
overview             0
release_date         0
dtype: int64

In [383]:
tmdb_discover.columns
# we don't need all of these columns, so I need a reminder right here of what I want to drop

Index(['popularity', 'vote_count', 'video', 'poster_path', 'id', 'adult',
       'backdrop_path', 'original_language', 'original_title', 'genre_ids',
       'title', 'vote_average', 'overview', 'release_date'],
      dtype='object')

### Data Cleanup

We're going to do the following work on this dataset to clean it up:
    
    a) drop entries with no genre specified. We'll want to use the genre to make recommendations.
    b) change our release date to standard format
    c) Drop unneeded columns
        * video - we know all of these values are false, as it was part of our API parameters
        * poster_path - provides a path to an image for the movie, which we don't need
        * adult - we know all of these values are false, as it was part of our API parameters
        * backdrop_path - another set of images, which we don't need
        * original_titles - if the movie is in a foreign language, the original title is here, we only need the english titles
        * overview - summary description of the movie, which we cannot use in visualization
        * original_language - we're only using english language movies, so this is a redundant field


We are NOT using the provided TMDB dataset from earlier in the notebook. We've found that we have higher quality data via our API pull, and will be using our tmdb_discover dataset and discarding our df2 dataset.

In [384]:
# cleaning up this dataset

# Drop all entries with no genre id
tmdb_discover.drop(tmdb_discover[(tmdb_discover['genre_ids'] == '[]')].index, inplace=True)

# using pandas built-in datetime converter to change our release date column to standard format
tmdb_discover['release_date'] = pd.to_datetime(tmdb_discover['release_date'])

#drop columns by name
tmdb_discover.drop(columns=['video', 'poster_path', 'adult', 'backdrop_path', 'original_title', 'overview', 'original_language'], inplace=True)
# columns dropped:  
# video - we know all of these values are false, as it was part of our API parameters

In [385]:
tmdb_discover # confirming that we have cleaned up our data and have only the information we need to use

,popularity,vote_count,id,genre_ids,title,vote_average,release_date
0,823.042,12617,354912,"[16, 10751, 35, 12, 14, 10402]",Coco,8.2,2017-10-27
1,356.048,5124,474350,"[27, 14]",It Chapter Two,6.9,2019-09-04
2,333.745,15365,475557,"[80, 53, 18]",Joker,8.2,2019-10-02
3,279.613,6340,330457,"[16, 10751, 12, 35, 14]",Frozen II,7.3,2019-11-20
4,204.021,3720,316727,"[28, 27, 53]",The Purge: Election Year,6.4,2016-06-29
...,...,...,...,...,...,...,...
2,0.600,40,184712,"[28, 27, 878]",Battledogs,5.0,2013-04-05
3,0.600,322,174323,"[35, 18]",G.B.F.,5.9,2013-10-20
4,0.600,41,173455,"[99, 10402]",Mistaken for Strangers,7.2,2013-09-19
5,0.600,37,136568,"[28, 878]",Dragon Wasps,5.0,2012-09-17
6,0.600,67,110393,[18],White Elephant,6.6,2012-05-16

We need this data set in order to make our API calls for the IMDB ID matchup, so we're going to export it to a csv that we can then import into our API production file.

In [386]:
tmdb_discover.to_csv('api_data/tmdb_discover.csv', index=False)

### IMDB ID Matchup

Our next goal is to match up IMDB movie ids for each of the movie ids in our data set. TMDB has an API to do exactly this - submit the TMDB id, and get an IMDB id in return. Each TMDB movie id is a parameter that must be passed to an individual API call, so we won't be using the web interface for this action.

We move to the tmdb_api_calls notebook to do this process.

We've exported our Discover Data Set up above and processed it in our API notebook, and will now re-import it here with our TMDB ids replaced with IMDB ids!

!!! STOP !!! Go to the API notebook tmdb_api_calls.ipynb and run the second section now.

In [387]:
tmdb_discover = pd.read_csv('api_data/tmdb_discover_converted.csv')

In [388]:
tmdb_discover
# we now have our original tmdb_discover dataset converted to IMDB ids instead of TMDB ids.
# We'll be able to cross reference this set later on with IMDB datasets.

,popularity,vote_count,id,genre_ids,title,vote_average,release_date
0,823.042,12617,tt2380307,"[16, 10751, 35, 12, 14, 10402]",Coco,8.2,2017-10-27
1,356.048,5124,tt7349950,"[27, 14]",It Chapter Two,6.9,2019-09-04
2,333.745,15365,tt7286456,"[80, 53, 18]",Joker,8.2,2019-10-02
3,279.613,6340,tt4520988,"[16, 10751, 12, 35, 14]",Frozen II,7.3,2019-11-20
4,204.021,3720,tt4094724,"[28, 27, 53]",The Purge: Election Year,6.4,2016-06-29
...,...,...,...,...,...,...,...
6462,0.600,40,tt2457138,"[28, 27, 878]",Battledogs,5.0,2013-04-05
6463,0.600,322,tt2429074,"[35, 18]",G.B.F.,5.9,2013-10-20
6464,0.600,41,tt2737310,"[99, 10402]",Mistaken for Strangers,7.2,2013-09-19
6465,0.600,37,tt2170371,"[28, 878]",Dragon Wasps,5.0,2012-09-17
6466,0.600,67,tt2132324,[18],White Elephant,6.6,2012-05-16

In [389]:
#Now that we have replaced our TMDB id with IMDB id, we'll set the IMDB id as our index
tmdb_discover.set_index('id', inplace=True)

In [390]:
# We no longer need the titles in this dataset, as we'll be merging it to our IMDB set on IMDB id
tmdb_discover.drop(columns=['title', 'release_date'], inplace=True)

In [391]:
# confirming it worked
tmdb_discover

,popularity,vote_count,genre_ids,vote_average
id,,,,
tt2380307,823.042,12617,"[16, 10751, 35, 12, 14, 10402]",8.2
tt7349950,356.048,5124,"[27, 14]",6.9
tt7286456,333.745,15365,"[80, 53, 18]",8.2
tt4520988,279.613,6340,"[16, 10751, 12, 35, 14]",7.3
tt4094724,204.021,3720,"[28, 27, 53]",6.4
...,...,...,...,...
tt2457138,0.600,40,"[28, 27, 878]",5.0
tt2429074,0.600,322,"[35, 18]",5.9
tt2737310,0.600,41,"[99, 10402]",7.2
tt2170371,0.600,37,"[28, 878]",5.0
tt2132324,0.600,67,[18],6.6

### Movie Genres Data Set

TMDB allows for browser-based API calls, so we will use their browser system for the simpler calls by copying the text results into our source code editor and saving each as a JSON

First up using https://developers.themoviedb.org/3/genres/get-movie-list to get a JSON dictionary of movie genres.

In [392]:
# We saved the resulting web-based text return as a JSON using our source code editor, and now we load it
f = open('api_data/tmdb_movie_genres.json')
data = json.load(f)
data

{'genres': [{'id': 28, 'name': 'Action'},
  {'id': 12, 'name': 'Adventure'},
  {'id': 16, 'name': 'Animation'},
  {'id': 35, 'name': 'Comedy'},
  {'id': 80, 'name': 'Crime'},
  {'id': 99, 'name': 'Documentary'},
  {'id': 18, 'name': 'Drama'},
  {'id': 10751, 'name': 'Family'},
  {'id': 14, 'name': 'Fantasy'},
  {'id': 36, 'name': 'History'},
  {'id': 27, 'name': 'Horror'},
  {'id': 10402, 'name': 'Music'},
  {'id': 9648, 'name': 'Mystery'},
  {'id': 10749, 'name': 'Romance'},
  {'id': 878, 'name': 'Science Fiction'},
  {'id': 10770, 'name': 'TV Movie'},
  {'id': 53, 'name': 'Thriller'},
  {'id': 10752, 'name': 'War'},
  {'id': 37, 'name': 'Western'}]}

In [393]:
tmdb_genres = pd.DataFrame.from_dict(data['genres']) # loading our JSON into a pandas dataframe

tmdb_genres.set_index('id', inplace=True) # Setting the genre id as our index

tmdb_genres # Looks as expected

                  name
id
28              Action
12           Adventure
16           Animation
35              Comedy
80               Crime
99         Documentary
18               Drama
10751           Family
14             Fantasy
36             History
27              Horror
10402            Music
9648           Mystery
10749          Romance
878    Science Fiction
10770         TV Movie
53            Thriller
10752              War
37             Western

### TO DO - movie genres integration

In [394]:
genres = data['genres']

genres

[{'id': 28, 'name': 'Action'},
 {'id': 12, 'name': 'Adventure'},
 {'id': 16, 'name': 'Animation'},
 {'id': 35, 'name': 'Comedy'},
 {'id': 80, 'name': 'Crime'},
 {'id': 99, 'name': 'Documentary'},
 {'id': 18, 'name': 'Drama'},
 {'id': 10751, 'name': 'Family'},
 {'id': 14, 'name': 'Fantasy'},
 {'id': 36, 'name': 'History'},
 {'id': 27, 'name': 'Horror'},
 {'id': 10402, 'name': 'Music'},
 {'id': 9648, 'name': 'Mystery'},
 {'id': 10749, 'name': 'Romance'},
 {'id': 878, 'name': 'Science Fiction'},
 {'id': 10770, 'name': 'TV Movie'},
 {'id': 53, 'name': 'Thriller'},
 {'id': 10752, 'name': 'War'},
 {'id': 37, 'name': 'Western'}]

In [395]:
tmdb_discover['genres'] = tmdb_discover['genre_ids'].map(genres[0])

In [396]:
tmdb_discover

,popularity,vote_count,genre_ids,vote_average,genres
id,,,,,
tt2380307,823.042,12617,"[16, 10751, 35, 12, 14, 10402]",8.2,NaN
tt7349950,356.048,5124,"[27, 14]",6.9,NaN
tt7286456,333.745,15365,"[80, 53, 18]",8.2,NaN
tt4520988,279.613,6340,"[16, 10751, 12, 35, 14]",7.3,NaN
tt4094724,204.021,3720,"[28, 27, 53]",6.4,NaN
...,...,...,...,...,...
tt2457138,0.600,40,"[28, 27, 878]",5.0,NaN
tt2429074,0.600,322,"[35, 18]",5.9,NaN
tt2737310,0.600,41,"[99, 10402]",7.2,NaN
tt2170371,0.600,37,"[28, 878]",5.0,NaN
tt2132324,0.600,67,[18],6.6,NaN

## Source 3 - Box Office Mojo

Box Office Mojo is part of IMDB pro and does not offer a personal-use API. We started with a provided BOM data set and scraped the Box Office Mojo page to match up the movie titles to IMDB IDs, and to retrieve production budgts when possible. This gives us a more robust data set which can be connected later to our IMDB data sets.

Our notebook Box_Office_Mojo_Web_Scraper.ipynb was used to scrape for the data, and we load our resulting csv.

### Exploring the Data

In [578]:
#Box Office Mojo movie gross
df3 = pd.read_csv('api_data/bom_imdb_boxoffice.csv')

In [579]:
df3

,tmdb_id,title,studio,domestic_gross,foreign_gross,year,budget
0,tt0435761,Toy Story 3,BV,415000000.0,652000000,2010,200000000.0
1,tt1014759,Alice in Wonderland (2010),BV,334200000.0,691300000,2010,200000000.0
2,tt0926084,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010,NaN
3,tt1375666,Inception,WB,292600000.0,535700000,2010,160000000.0
4,tt0892791,Shrek Forever After,P/DW,238700000.0,513900000,2010,165000000.0
...,...,...,...,...,...,...,...
3246,tt6776572,Beauty and the Dogs,Osci.,8900.0,NaN,2018,NaN
3247,tt6523720,The Quake,Magn.,6200.0,NaN,2018,NaN
3248,NaN,Edward II (2018 re-release),FM,4800.0,NaN,2018,NaN
3249,tt0093177,El Pacto,Sony,2500.0,NaN,2018,NaN
3250,tt5718046,An Actor Prepares,Grav.,1700.0,NaN,2018,NaN

In [580]:
# what is the shape of our data?
df3.shape
# this dataset has 3251 movie entries

(3251, 7)

In [581]:
# what kind of data is stored?
df3.dtypes
# Most of this data is stored correctly, except foreign_gross. We will have to fix this column

tmdb_id            object
title              object
studio             object
domestic_gross    float64
foreign_gross      object
year                int64
budget            float64
dtype: object

In [582]:
# do we have any missing/null values?
df3.isnull().sum()
# This dataset is missing a few tmdb_ids, which is how we will connect this data to our IMDB dataset later. We'll drop these rows.

tmdb_id             76
title                0
studio               0
domestic_gross       0
foreign_gross     1289
year                 0
budget            2147
dtype: int64

In [583]:
round(df3.describe(), 2)
# One useful bit of info we get is that the earliest movie on this list is from 2010, and the latest is from 2018

       domestic_gross     year        budget
count    3.251000e+03  3251.00  1.104000e+03
mean     2.967050e+07  2013.97  5.607219e+07
std      6.788942e+07     2.47  5.521979e+07
min      1.000000e+02  2010.00  1.000000e+05
25%      1.280000e+05  2012.00  1.700000e+07
50%      1.500000e+06  2014.00  3.500000e+07
75%      3.035000e+07  2016.00  7.500000e+07
max      9.367000e+08  2018.00  3.170000e+08

In [584]:
df3.sort_values('domestic_gross', ascending=False).head(30)
# The foreign_gross column needs to be fixed and turned into a float. Right now it is an object and does not sort properly.

,tmdb_id,title,studio,domestic_gross,foreign_gross,year,budget
1793,tt2488496,Star Wars: The Force Awakens,BV,936700000.0,"1,131.6",2015,245000000.0
2956,tt1825683,Black Panther,BV,700100000.0,646900000,2018,NaN
2955,tt4154756,Avengers: Infinity War,BV,678800000.0,"1,369.5",2018,NaN
1794,tt0369610,Jurassic World,Uni.,652300000.0,"1,019.4",2015,150000000.0
690,tt0848228,Marvel's The Avengers,BV,623400000.0,895500000,2012,220000000.0
2647,tt2527336,Star Wars: The Last Jedi,BV,620200000.0,712400000,2017,317000000.0
2958,tt3606756,Incredibles 2,BV,608600000.0,634200000,2018,NaN
2227,tt3748528,Rogue One: A Star Wars Story,BV,532200000.0,523900000,2016,200000000.0
2648,tt2771200,Beauty and the Beast (2017),BV,504000000.0,759500000,2017,160000000.0
2228,tt2277860,Finding Dory,BV,486300000.0,542300000,2016,NaN
1796,tt2395427,Avengers: Age of Ultron,BV,459000000.0,946400000,2015,250000000.0
692,tt1345836,The Dark Knight Rises,WB,448100000.0,636800000,2012,250000000.0
1081,tt1951264,The Hunger Games: Catching Fire,LGF,424700000.0,440300000,2013,130000000.0
2957,tt4881806,Jurassic World: Fallen Kingdom,Uni.,417700000.0,891800000,2018,170000000.0
0,tt0435761,Toy Story 3,BV,415000000.0,652000000,2010,200000000.0
2655,tt0451279,Wonder Woman,WB,412600000.0,409300000,2017,149000000.0
1078,tt1300854,Iron Man 3,BV,409000000.0,805800000,2013,200000000.0
2226,tt3498820,Captain America: Civil War,BV,408100000.0,745200000,2016,250000000.0
698,tt1392170,The Hunger Games,LGF,408000000.0,286400000,2012,78000000.0
2651,tt2283362,Jumanji: Welcome to the Jungle,Sony,404500000.0,557600000,2017,90000000.0
1077,tt2294629,Frozen,BV,400700000.0,875700000,2013,150000000.0
2653,tt3896198,Guardians of the Galaxy Vol. 2,BV,389800000.0,473900000,2017,200000000.0
306,tt1201607,Harry Potter and the Deathly Hallows Part 2,WB,381000000.0,960500000,2011,NaN
2231,tt2709768,The Secret Life of Pets,Uni.,368400000.0,507100000,2016,75000000.0
1079,tt1690953,Despicable Me 2,Uni.,368100000.0,602700000,2013,76000000.0
2230,tt3040964,The Jungle Book (2016),BV,364000000.0,602500000,2016,175000000.0
2234,tt1431045,Deadpool,Fox,363100000.0,420000000,2016,58000000.0
1799,tt2096673,Inside Out,BV,356500000.0,501100000,2015,175000000.0
1795,tt2820852,Furious 7,Uni.,353000000.0,"1,163.0",2015,190000000.0
307,tt1399103,Transformers: Dark of the Moon,P/DW,352400000.0,771400000,2011,195000000.0

### Data Cleanup

We performed some of our data cleanup during our web scrape, but we'll be doing these additional tasks:

    * Set our IMDB ID as the index so we can join on this field later
    * Eliminate any rows where we could not find an IMDB ID
    * Remove the title column, as we'll use the title column from our IMDB data set when we join this one in
    * Remove the year column, as we'll use the year column from our IMDB data set when we join this one in
    * Turn our foreign_gross column into an integer

In [585]:
# Converting the foreign_gross field into an integer
for ind in df3.index:
    if ',' in str(df3['foreign_gross'][ind]):
        text = str(df3['foreign_gross'][ind])
        result = re.sub(r"[,@\'?\.$%_:â()-]", "", text, flags=re.I)
        result = re.sub(r"\s+"," ", result, flags = re.I)
        result = result + '00000'
        df3['foreign_gross'][ind] = int(result)
    else:
        continue

C:\Users\Wadkins\anaconda3\envs\learn-env\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [587]:
# Turn all of the null values on the foreign gross into 0
df3.loc[df3['foreign_gross'].isnull(), 'foreign_gross'] = 0

In [588]:
# make sure all entries in the foreign_gross column are integers
df3['foreign_gross'] = df3['foreign_gross'].astype(int)

In [589]:
#checking that our foreign_gross is repaired
df3.sort_values('domestic_gross', ascending=False).head(30)

,tmdb_id,title,studio,domestic_gross,foreign_gross,year,budget
1793,tt2488496,Star Wars: The Force Awakens,BV,936700000.0,1131600000,2015,245000000.0
2956,tt1825683,Black Panther,BV,700100000.0,646900000,2018,NaN
2955,tt4154756,Avengers: Infinity War,BV,678800000.0,1369500000,2018,NaN
1794,tt0369610,Jurassic World,Uni.,652300000.0,1019400000,2015,150000000.0
690,tt0848228,Marvel's The Avengers,BV,623400000.0,895500000,2012,220000000.0
2647,tt2527336,Star Wars: The Last Jedi,BV,620200000.0,712400000,2017,317000000.0
2958,tt3606756,Incredibles 2,BV,608600000.0,634200000,2018,NaN
2227,tt3748528,Rogue One: A Star Wars Story,BV,532200000.0,523900000,2016,200000000.0
2648,tt2771200,Beauty and the Beast (2017),BV,504000000.0,759500000,2017,160000000.0
2228,tt2277860,Finding Dory,BV,486300000.0,542300000,2016,NaN
1796,tt2395427,Avengers: Age of Ultron,BV,459000000.0,946400000,2015,250000000.0
692,tt1345836,The Dark Knight Rises,WB,448100000.0,636800000,2012,250000000.0
1081,tt1951264,The Hunger Games: Catching Fire,LGF,424700000.0,440300000,2013,130000000.0
2957,tt4881806,Jurassic World: Fallen Kingdom,Uni.,417700000.0,891800000,2018,170000000.0
0,tt0435761,Toy Story 3,BV,415000000.0,652000000,2010,200000000.0
2655,tt0451279,Wonder Woman,WB,412600000.0,409300000,2017,149000000.0
1078,tt1300854,Iron Man 3,BV,409000000.0,805800000,2013,200000000.0
2226,tt3498820,Captain America: Civil War,BV,408100000.0,745200000,2016,250000000.0
698,tt1392170,The Hunger Games,LGF,408000000.0,286400000,2012,78000000.0
2651,tt2283362,Jumanji: Welcome to the Jungle,Sony,404500000.0,557600000,2017,90000000.0
1077,tt2294629,Frozen,BV,400700000.0,875700000,2013,150000000.0
2653,tt3896198,Guardians of the Galaxy Vol. 2,BV,389800000.0,473900000,2017,200000000.0
306,tt1201607,Harry Potter and the Deathly Hallows Part 2,WB,381000000.0,960500000,2011,NaN
2231,tt2709768,The Secret Life of Pets,Uni.,368400000.0,507100000,2016,75000000.0
1079,tt1690953,Despicable Me 2,Uni.,368100000.0,602700000,2013,76000000.0
2230,tt3040964,The Jungle Book (2016),BV,364000000.0,602500000,2016,175000000.0
2234,tt1431045,Deadpool,Fox,363100000.0,420000000,2016,58000000.0
1799,tt2096673,Inside Out,BV,356500000.0,501100000,2015,175000000.0
1795,tt2820852,Furious 7,Uni.,353000000.0,1163000000,2015,190000000.0
307,tt1399103,Transformers: Dark of the Moon,P/DW,352400000.0,771400000,2011,195000000.0

In [590]:
# dropping the title and year columns
df3.drop(columns=['title', 'year'], inplace=True)

In [591]:
# dropping any rows where we didn't find an imdb id
df3 = df3[df3['tmdb_id'].notna()]

In [592]:
# set the imdb id as the index (mistakenly named tmdb_id)
df3.set_index('tmdb_id', inplace=True)

In [593]:
df3

            studio  domestic_gross  foreign_gross       budget
tmdb_id
tt0435761       BV     415000000.0      652000000  200000000.0
tt1014759       BV     334200000.0      691300000  200000000.0
tt0926084       WB     296000000.0      664300000          NaN
tt1375666       WB     292600000.0      535700000  160000000.0
tt0892791     P/DW     238700000.0      513900000  165000000.0
...            ...             ...            ...          ...
tt6054874  CARUSEL         10000.0              0          NaN
tt6776572    Osci.          8900.0              0          NaN
tt6523720    Magn.          6200.0              0          NaN
tt0093177     Sony          2500.0              0          NaN
tt5718046    Grav.          1700.0              0          NaN

[3175 rows x 4 columns]

## Source 4 - IMDB

While we do our cleanup analysis on each of these IMDB data sets, we'll explore how they will interact with each other when we merge them. We'll determine what needs to be cleaned before vs after merging the datasets.

### User ratings per movie ID

In [409]:
# import imdb user ratings per movie
df4 = pd.read_csv('zippedData/title.ratings.csv')

#### Exploring the Data

In [410]:
# taking a look at what we've imported
df4
# this dataset is using the movie id and showing the average rating, and the number of votes

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [411]:
# what is the shape of our data?
df4.shape
# this dataset has 73,856 movie entries

(73856, 3)

In [412]:
# what kind of data is stored?
df4.dtypes
# The data in this set appears to be stored in the proper formats

tconst            object
averagerating    float64
numvotes           int64
dtype: object

In [413]:
# what are our columns?
df4.columns
# The 'tconst' will be found throughout our IMDB datasets. We will consider turning it into our index for all of the IMDB datasets.

Index(['tconst', 'averagerating', 'numvotes'], dtype='object')

In [414]:
# do we have any missing/null values?
df4.isnull().sum()
# This dataset has no missing values. That doesn't mean there aren't categorical placeholders, and we will look into that further

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [415]:
round(df4.describe(), 2)

       averagerating    numvotes
count       73856.00    73856.00
mean            6.33     3523.66
std             1.47    30294.02
min             1.00        5.00
25%             5.50       14.00
50%             6.50       49.00
75%             7.40      282.00
max            10.00  1841066.00

#### Data Cleanup

In [416]:
#We make the unique "tconst" into our index.
df4.set_index('tconst', inplace=True)

In [417]:
df4

            averagerating  numvotes
tconst
tt10356526            8.3        31
tt10384606            8.9       559
tt1042974             6.4        20
tt1043726             4.2     50352
tt1060240             6.5        21
...                   ...       ...
tt9805820             8.1        25
tt9844256             7.5        24
tt9851050             4.7        14
tt9886934             7.0         5
tt9894098             6.3       128

[73856 rows x 2 columns]

### Cast and crew per movie ID

In [418]:
# import imdb primary cast and crew per movie
df5 = pd.read_csv('zippedData/title.principals.csv')

#### Exploring the Data

In [419]:
# taking a look at what we've imported
df5
# this dataset is using the movie id and showing the principal cast and crew for each movie, by the cast/crew id

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,2,nm0398271,director,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,NaN,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,NaN,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,NaN,NaN
1028184,tt9692684,4,nm6009913,writer,writer,NaN
1028185,tt9692684,5,nm10441595,producer,producer,NaN

In [420]:
# what is the shape of our data?
df5.shape
# this dataset has 1,028,186 cast and crew entries

(1028186, 6)

In [421]:
# what kind of data is stored?
df5.dtypes
# The data in this set appears to be stored in the proper formats

tconst        object
ordering       int64
nconst        object
category      object
job           object
characters    object
dtype: object

In [422]:
# what are our columns?
df5.columns
# The 'tconst' will be found throughout our IMDB datasets. We will turn it into our index for all of the IMDB datasets.

Index(['tconst', 'ordering', 'nconst', 'category', 'job', 'characters'], dtype='object')

In [423]:
# do we have any missing/null values?
df5.isnull().sum()
# This dataset has large numbers of missing values. We will inspect the data itself to determine if this is important.

tconst             0
ordering           0
nconst             0
category           0
job           850502
characters    634826
dtype: int64

After studying this dataset, we see that the movie id (tconst) is not unique. Because of this, we will not turn the tconst value into the index in any of the datasets.

#### Data Cleanup

We will remove three unnecessary columns that are not needed for making recommendations.

In [424]:
# After inspecting the data, we can see that the "job" column is generally an extension of the "category" column 
# We will drop this column.
df5.drop(columns=['job'], inplace=True)

# We can also see that the "ordering" column is just for sorting the different jobs for each movie id
# we don't really need this column and will remove it as well
df5.drop(columns=['ordering'], inplace=True)

# lastly, we want all of our data to contribute to a recommendation, and while the actors themselves may be important,
# the characters they play do not seem particularly important. We will also drop the "characters" column
df5.drop(columns=['characters'], inplace=True)

In [425]:
df5

            tconst      nconst  category
0        tt0111414   nm0246005     actor
1        tt0111414   nm0398271  director
2        tt0111414   nm3739909  producer
3        tt0323808   nm0059247    editor
4        tt0323808   nm3579312   actress
...            ...         ...       ...
1028181  tt9692684   nm0186469     actor
1028182  tt9692684   nm4929530      self
1028183  tt9692684  nm10441594  director
1028184  tt9692684   nm6009913    writer
1028185  tt9692684  nm10441595  producer

[1028186 rows x 3 columns]

### Director and writer assignments per movie id

In [426]:
#IMDB directors and writers per movie
df6 = pd.read_csv('zippedData/title.crew.csv')

#### Exploring the Data

This appears to give the same information as the previous data set, but in a different format. Let's do a few comparisons and see if that is the case.

In [427]:
df6

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]

In [428]:
temp = df5.loc[df5['tconst'] == 'tt0417610']
temp
# our director is nm1145057 and our writer is nm0083201, let's check if it's the same in dataset 6

       tconst     nconst  category
13  tt0417610  nm0284261  composer
14  tt0417610  nm0532721     actor
15  tt0417610  nm0330974   actress
16  tt0417610  nm0069209     actor
17  tt0417610  nm0679167   actress
18  tt0417610  nm1145057  director
19  tt0417610  nm0083201    writer
20  tt0417610  nm0147416  producer
21  tt0417610  nm0215732  producer
22  tt0417610  nm1900304  producer

In [429]:
temp = df6.loc[df6['tconst'] == 'tt0417610']
temp
# at first glance it's not the same! But then we see that the director is also a writer.

          tconst  directors              writers
36477  tt0417610  nm1145057  nm0083201,nm1145057

In [430]:
# using this information, we'll have to decide if we want to value when a person is credited in multiple roles.

# let's check one more multi-role
temp = df5.loc[df5['tconst'] == 'tt0999913']
temp
# we have 1 director and 3 writers listed

           tconst     nconst  category
144169  tt0999913  nm0343935  composer
144170  tt0999913  nm0005188     actor
144171  tt0999913  nm0098378   actress
144172  tt0999913  nm0002907     actor
144173  tt0999913  nm0000249     actor
144174  tt0999913  nm0527109  director
144175  tt0999913  nm0329051    writer
144176  tt0999913  nm0001603    writer
144177  tt0999913  nm0930684    writer
144178  tt0999913  nm0296827  producer

In [431]:
temp = df6.loc[df6['tconst'] == 'tt0999913']
temp
# 1 director and 4 writers, where one of the writers is the director.

      tconst  directors                                  writers
7  tt0999913  nm0527109  nm0527109,nm0329051,nm0001603,nm0930684

In [432]:
# Let's take a look at a listing from this dataset with no writer attached, in dataset 5
temp = df5.loc[df5['tconst'] == 'tt0879859']
temp
# there is indeed no writer attached to this movie according to dataset 5

           tconst     nconst         category
144129  tt0879859  nm1269186           editor
144130  tt0879859  nm0028844            actor
144131  tt0879859  nm2421419          actress
144132  tt0879859  nm0090301          actress
144133  tt0879859  nm3127072          actress
144134  tt0879859  nm2416460         director
144135  tt0879859  nm0505953         producer
144136  tt0879859  nm0614195         producer
144137  tt0879859  nm1244349         composer
144138  tt0879859  nm0806706  cinematographer

#### Data Cleanup

Based on what we are seeing here, we are NOT going to use this dataset. We'll use the other cast and crew dataset to get this same information already broken apart, rather than having to break apart this dataset.

### Movie stats per movie ID

In [433]:
# import imdb stats per movie
df7 = pd.read_csv('zippedData/title.basics.csv')

#### Exploring the Data

In [434]:
# taking a look at what we've imported
df7
# this dataset is using the movie id and finally we have the title of the movie, as well as the year, the runtime, and the genres

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [435]:
# what is the shape of our data?
df7.shape
# this dataset has 146,144 movie entries

(146144, 6)

In [436]:
# what kind of data is stored?
df7.dtypes
# The data in this set appears to be stored in the proper formats

tconst              object
primary_title       object
original_title      object
start_year           int64
runtime_minutes    float64
genres              object
dtype: object

In [437]:
# what are our columns?
df7.columns
# The 'tconst' is found throughout our IMDB datasets and is the movie identifier
# we will want to understand the distinction between primary_title and original_title

Index(['tconst', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres'],
      dtype='object')

In [438]:
# do we have any missing/null values?
df7.isnull().sum()
# This dataset has some missing values. We will inspect the data itself to determine if this is important.
# there are no primary titles or years missing, which seems like the most important data to have

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [439]:
df7.describe()
# the IMDB dataset starts at 2010, and includes unreleased future movies! This is really going to skew our dataset!
# we are only going to use movies up to 2019.

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [440]:
# let's look at where the primary title and original title don't match in order to understand more about that
temp = df7.loc[(df7['primary_title']) != (df7['original_title'])]
temp
# We can see from this that the original title is the movie's foreign language title. We will use the translated
# primary_title and drop this column

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
11,tt0154039,So Much for Justice!,Oda az igazság,2010,100.0,History
13,tt0162942,Children of the Green Dragon,A zöld sárkány gyermekei,2010,89.0,Drama
15,tt0176694,The Tragedy of Man,Az ember tragédiája,2011,160.0,"Animation,Drama,History"
...,...,...,...,...,...,...
146026,tt9899938,Journey of the Sky Goddess,Kibaiyanse! Watashi,2019,116.0,"Comedy,Drama"
146028,tt9900060,Lupin the Third: Fujiko Mine's Lie,Lupin the IIIrd: Mine Fujiko no Uso,2019,NaN,"Adventure,Crime,Drama"
146037,tt9900688,Big Three Dragons,Da San Yuan,2019,111.0,Comedy
146121,tt9914254,A Cherry Tale,Kirsebæreventyret,2019,85.0,Documentary
146135,tt9916170,The Rehearsal,O Ensaio,2019,51.0,Drama

In [441]:
# Does this list include only movies, or does it also have shows? Let's take a look at runtime minutes
df7.sort_values('runtime_minutes', ascending=False).head()
# It's not clear if these are movies or shows

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
132389,tt8273150,Logistics,Logistics,2012,51420.0,Documentary
44840,tt2659636,Modern Times Forever,Modern Times Forever,2011,14400.0,Documentary
123467,tt7492094,Nari,Nari,2017,6017.0,Documentary
87264,tt5068890,Hunger!,Hunger!,2015,6000.0,"Documentary,Drama"
88717,tt5136218,London EC1,London EC1,2015,5460.0,"Comedy,Drama,Mystery"

#### Data Cleanup

    1) Drop titles where the original title and translated title are not the same, indicating a foreign language film
    2) use regex to remove as many special characters from titles as possible, in hopes of matching this up with other data later
    3) set our IMDB id as our index
    4) Remove movies released after 2020 
    5) Dropping unnecessary column "original_title"

In [442]:
# Drop foreign language films. We'll create a dummy column by comparing on movie title, then we'll use that column's 
# boolean result to find and drop the films, then drop the dummy column
df7['foreign'] = (df7['primary_title'] != df7['original_title'])
df7.drop(df7[(df7['foreign'] == True)].index, inplace=True)
df7.drop(columns=['foreign'], inplace=True)
df7

# It doesn't get rid of all of our foreign language films, but it did remove around 14,000.

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [443]:
# use regex to remove all non-word characters
for ind in df7.index:
    text = str(df7['primary_title'][ind])
    result = re.sub(r"[,@\'?\.$%_:â()-]", "", text, flags=re.I)
    result = re.sub(r"\s+"," ", result, flags = re.I)
    df7['primary_title'][ind] = result

C:\Users\Wadkins\anaconda3\envs\learn-env\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [444]:
# Set tconst movie id as index
df7.set_index('tconst', inplace=True)

# Drop all movies from 2020 or later
df7.drop(df7[(df7['start_year'] >= 2020)].index, inplace=True)

# Drop original_title column
df7.drop(columns=['original_title'], inplace=True)

In [445]:
# Confirming we dropped all movies with a start year after 2019
df7.sort_values('start_year', ascending=False).head(10)

,primary_title,start_year,runtime_minutes,genres
tconst,,,,
tt7547410,Dora and the Lost City of Gold,2019,NaN,"Adventure,Family"
tt9421920,Vrienten & Vrienten in Basmannen,2019,NaN,Documentary
tt9425552,About Bintou,2019,13.0,Documentary
tt6534616,Empire Queen,2019,NaN,Fantasy
tt9423248,Reaching for the Sun,2019,NaN,Documentary
tt2584384,Jojo Rabbit,2019,NaN,"Comedy,Drama,War"
tt7475206,Non ci resta che il crimine,2019,102.0,"Comedy,Crime"
tt6533972,Princess of the Row,2019,85.0,Drama
tt9420744,Tembang Lingsir,2019,90.0,Horror
tt7473716,The Gallows Act II,2019,NaN,"Horror,Thriller"

### Alternate titles per movie ID

In [446]:
# import imdb alternate titles
df8 = pd.read_csv('zippedData/title.akas.csv')

#### Exploring the Data

In [447]:
# taking a look at what we've imported
df8

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atención,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atención,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

#### Data Cleanup

It is immediately apparent that this dataset lists all of the alternate titles for each movie id.

We won't be using this dataset.

### Detailed crew info per person ID

In [448]:
# import imdb detailed crew information
df9 = pd.read_csv('zippedData/name.basics.csv')

#### Exploring the Data

In [449]:
# taking a look at what we've imported
df9
# this dataset has the information about the cast and crew ids

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [450]:
# what is the shape of our data?
df9.shape
# this dataset has 606,648 people entries

(606648, 6)

In [451]:
# what kind of data is stored?
df9.dtypes
# The data in this set appears to be stored in the proper formats

nconst                 object
primary_name           object
birth_year            float64
death_year            float64
primary_profession     object
known_for_titles       object
dtype: object

In [452]:
# what are our columns?
df9.columns

Index(['nconst', 'primary_name', 'birth_year', 'death_year',
       'primary_profession', 'known_for_titles'],
      dtype='object')

In [453]:
# do we have any missing/null values?
df9.isnull().sum()
# This dataset has a lot of missing values for birth year, death year, profession, and known for.
# We don't need some of this information, including birth year, profession and known for
# We will keep death year to make sure we don't make any recommendations for cast/crew that is deceased

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

#### Data Cleanup

In [454]:
# the only info we need on people is if they are alive, so we will drop their year of birth
df9.drop(columns=['birth_year'], inplace=True)

# We don't need the specific professions of our players. We can see their role from dataset 5
df9.drop(columns=['primary_profession'], inplace=True)

# We're going to use other, more quantifiable metrics of popularity than the known for information
df9.drop(columns=['known_for_titles'], inplace=True)

# we will make the unique nconst the index
df9.set_index('nconst', inplace=True)

In [455]:
df9.head()
df9.sort_values('death_year').head()
# now we realize that we can have writers and composers that are long deceased. We are going to keep the death_year column.

                 primary_name  death_year
nconst
nm0653992                Ovid        17.0
nm0613556    Shikibu Murasaki      1031.0
nm0019604     Dante Alighieri      1321.0
nm0090504  Giovanni Boccaccio      1375.0
nm1063158         Cheng'en Wu      1581.0

## Source 5 - Rotten Tomatoes

### Exploring the Data

In [456]:
df10 = pd.read_csv('zippedData/rt.reviews.tsv', sep='\t', encoding='Latin-1')
df10.tail()

#It's immediately apparent that these are the posted reviews for movies on rotten tomatoes, using the id of the movie

,id,review,rating,fresh,critic,top_critic,publisher,date
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [457]:
df11 = pd.read_csv('zippedData/rt.movie_info.tsv', sep='\t', encoding='Latin-1')
df11.tail()

# this is the information on the movies, by id. But it doesn't include the movie name!!

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

After checking out the Rotten Tomatoes/Fandango API usage, we see that they do not grant API access to individuals. We will have to scrape for more data if we want to use this data. right now, we have no idea what the names of the movies are.

## Data Summary and Joins

After our initial data pulls and cleanup, we have the following data sets to use:


    df1 - Box office numbers with 'movie' by name as the unique key

    tmdb_discover - TMDB movie information, join 'id' on imdb data's 'tconst'

    tmdb_genres - can be joined into tmdb_discover on id

    df3 - IMDB/BOM Box office numbers, join 'imdb_id' on 'tconst'

    df4 - IMDB User ratings and votes for each movie id. Join on movie id (tconst).

    df5 - IMDB Cast and crew for each movie id. Join on movie id tconst and/or person id nconst

    df6 - DO NOT USE. Redundant information with df5.

    df7 - IMDB Movie title, year, runtime and genre for each movie id. Join on movie id (tconst).

    df8 - DO NOT USE. Alternate titles.

    df9 - IMDB Cast and crew info. Join on nconst.

### Data Join Plan

   ##### master_movies = df4 + df7 + tmdb_discover + df3
        This dataset will reference movies by IMDB ID and have the average ratings, vote counts, studio, and financials where available
   ##### imdb_crew = df5 + df9
        This dataset will reference cast/crew members by their unique id, as well as specify IMDB IDs that they have worked on, and the job they performed
   ##### box_office = df1 + df3
        This dataset has box office gross and net information, but at present can only be linked to the master_movies dataset through title matching

### Dataframe Join - master_movies
df4 + df7 + df3 + tmdb_movies (movie stats + user ratings and votes + 2nd movie stats)

In [594]:
# We are joining our df4 and df7 on the tconst which is the movie id
master_movies = df7.join([df4, df3, tmdb_discover])
master_movies

,primary_title,start_year,runtime_minutes,genres_x,averagerating,numvotes,studio,domestic_gross,foreign_gross,budget,popularity,vote_count,genre_ids,vote_average,genres_y
tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt0069049,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0,NaN,NaN,NaN,NaN,9.674,106.0,"[35, 18]",6.8,NaN
tt0069204,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt0111414,A Thin Life,2018,75.0,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt0112502,Bigfoot,2017,NaN,"Horror,Thriller",4.1,32.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
tt9916538,Kuambil Lagi Hatiku,2019,123.0,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt9916622,Rodolpho Teóphilo O Legado de um Pioneiro,2015,NaN,Documentary,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt9916706,Dankyavar Danka,2013,NaN,Comedy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt9916730,6 Gunn,2017,116.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt9916754,Chico Albuquerque Revelações,2013,NaN,Documentary,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [595]:
#how many null values are there in the averagerating and numvotes categories?
master_movies.isnull().sum()

primary_title           0
start_year              0
runtime_minutes     29667
genres_x             5132
averagerating       68922
numvotes            68922
studio             128330
domestic_gross     128330
foreign_gross      128330
budget             129649
popularity         125605
vote_count         125605
genre_ids          125605
vote_average       125605
genres_y           130661
dtype: int64

#### Data Cleanup

In [596]:
# we're not interested in any movies that aren't even popular enough to have ratings on IMDB. We are dropping all movies
# with no rating entries, and all movies with fewer than 30 votes, just like our df2 cleanup
master_movies.drop(master_movies[master_movies['averagerating'].isnull()].index, inplace=True)
master_movies.drop(master_movies[master_movies['numvotes'] <= 30].index, inplace=True)

In [597]:
master_movies.sort_values('numvotes', ascending=False)
# We now have 33,813 entries

,primary_title,start_year,runtime_minutes,genres_x,averagerating,numvotes,studio,domestic_gross,foreign_gross,budget,popularity,vote_count,genre_ids,vote_average,genres_y
tt1375666,Inception,2010,148.0,"Action,Adventure,Sci-Fi",8.8,1841066.0,WB,292600000.0,535700000.0,160000000.0,54.781,27499.0,"[28, 878, 12]",8.3,NaN
tt1345836,The Dark Knight Rises,2012,164.0,"Action,Thriller",8.4,1387769.0,WB,448100000.0,636800000.0,250000000.0,48.514,16841.0,"[28, 80, 18, 53]",7.7,NaN
tt0816692,Interstellar,2014,169.0,"Adventure,Drama,Sci-Fi",8.6,1299334.0,Par.,188000000.0,489400000.0,165000000.0,93.257,24086.0,"[12, 18, 878]",8.3,NaN
tt1853728,Django Unchained,2012,165.0,"Drama,Western",8.4,1211405.0,Wein.,162800000.0,262600000.0,100000000.0,42.519,19357.0,"[18, 37]",8.1,NaN
tt0848228,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi",8.1,1183655.0,BV,623400000.0,895500000.0,220000000.0,96.039,23379.0,"[878, 28, 12]",7.7,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
tt2243220,Er relajo der loro,2012,NaN,Comedy,6.3,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt2965384,On Angels Wings,2014,84.0,"Family,Sport",5.5,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt6789370,Sukhamano Daveede,2018,122.0,"Comedy,Drama",5.8,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt2248608,Itaker Vietato agli italiani,2012,88.0,Drama,6.4,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
tt4123888,Awaken the Devil,2014,88.0,Horror,3.0,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [598]:
# We make a new column that takes the average rating of our two rating entries. This ignores any NaN and won't use them
# in the resulting calculation
master_movies['rating'] = master_movies[['averagerating', 'vote_average']].mean(axis=1)

In [599]:
# We make a new column that takes the sum of our two vote counts. This ignores any NaN and won't use them
# in the resulting calculation
master_movies['total_votes'] = master_movies[['numvotes', 'vote_count']].sum(axis=1)

In [600]:
# We now want to clean up the extra columns that we reassigned. We're dropping the individual rating and vote count columns
# from our different dataframes that we just used to create new columns
master_movies.drop(columns=['averagerating', 'numvotes', 'vote_count', 'vote_average'], inplace=True)

In [601]:
# We make a new column for the domestic net for the movie
master_movies['domestic_net'] = (master_movies['domestic_gross'] - master_movies['budget'])

In [602]:
# We make a new column for the foreign net net for the movie
master_movies['worldwide_net'] = (master_movies['foreign_gross'] - master_movies['budget'])

In [605]:
round(master_movies.describe(), 0)

,start_year,runtime_minutes,domestic_gross,foreign_gross,budget,popularity,rating,total_votes,domestic_net,worldwide_net
count,33813.0,31918.0,2318.0,2.318000e+03,1007.0,4899.0,33813.0,33813.0,1007.0,1007.0
mean,2014.0,98.0,38912433.0,5.862687e+07,57080238.0,17.0,6.0,7527.0,17899770.0,55217936.0
std,3.0,84.0,74937503.0,1.338197e+08,54782619.0,24.0,1.0,45829.0,68771111.0,128573894.0
min,2010.0,8.0,100.0,0.000000e+00,100000.0,1.0,1.0,31.0,-194940000.0,-192400000.0
25%,2012.0,85.0,378250.0,0.000000e+00,19000000.0,8.0,5.0,67.0,-13200000.0,-10300000.0
50%,2014.0,93.0,6900000.0,5.050000e+06,37000000.0,11.0,6.0,183.0,6000000.0,9500000.0
75%,2017.0,106.0,45100000.0,4.667500e+07,78500000.0,18.0,7.0,773.0,38250000.0,66200000.0
max,2019.0,14400.0,936700000.0,1.369500e+09,275000000.0,823.0,10.0,1868565.0,691700000.0,886600000.0

In [604]:
master_movies.sort_values('domestic_gross', ascending=False).head(10)

,primary_title,start_year,runtime_minutes,genres_x,studio,domestic_gross,foreign_gross,budget,popularity,genre_ids,genres_y,rating,total_votes,domestic_net,worldwide_net
tt2488496,Star Wars Episode VII The Force Awakens,2015,136.0,"Action,Adventure,Fantasy",BV,936700000.0,1.131600e+09,245000000.0,56.758,"[28, 12, 878, 14]",NaN,7.70,799848.0,691700000.0,886600000.0
tt1825683,Black Panther,2018,134.0,"Action,Adventure,Sci-Fi",BV,700100000.0,6.469000e+08,NaN,113.701,"[28, 12, 14, 878]",NaN,7.35,532382.0,NaN,NaN
tt4154756,Avengers Infinity War,2018,149.0,"Action,Adventure,Sci-Fi",BV,678800000.0,1.369500e+09,NaN,202.211,"[12, 28, 878]",NaN,8.40,690975.0,NaN,NaN
tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",Uni.,652300000.0,1.019400e+09,150000000.0,81.881,"[28, 12, 878, 53]",NaN,6.80,555491.0,502300000.0,869400000.0
tt0848228,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi",BV,623400000.0,8.955000e+08,220000000.0,96.039,"[878, 28, 12]",NaN,7.90,1207034.0,403400000.0,675500000.0
tt3606756,Incredibles 2,2018,118.0,"Action,Adventure,Animation",BV,608600000.0,6.342000e+08,NaN,97.218,"[28, 12, 16, 10751]",NaN,7.60,212766.0,NaN,NaN
tt2771200,Beauty and the Beast,2017,129.0,"Family,Fantasy,Musical",BV,504000000.0,7.595000e+08,160000000.0,59.990,"[10751, 14, 10749]",NaN,7.10,251236.0,344000000.0,599500000.0
tt2277860,Finding Dory,2016,97.0,"Adventure,Animation,Comedy",BV,486300000.0,5.423000e+08,NaN,35.074,"[12, 16, 35, 10751]",NaN,7.15,222940.0,NaN,NaN
tt2395427,Avengers Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi",BV,459000000.0,9.464000e+08,250000000.0,79.883,"[28, 12, 878]",NaN,7.30,682324.0,209000000.0,696400000.0
tt1345836,The Dark Knight Rises,2012,164.0,"Action,Thriller",WB,448100000.0,6.368000e+08,250000000.0,48.514,"[28, 80, 18, 53]",NaN,8.05,1404610.0,198100000.0,386800000.0

In [606]:
master_movies

,primary_title,start_year,runtime_minutes,genres_x,studio,domestic_gross,foreign_gross,budget,popularity,genre_ids,genres_y,rating,total_votes,domestic_net,worldwide_net
tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama",NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.00,77.0,NaN,NaN
tt0069049,The Other Side of the Wind,2018,122.0,Drama,NaN,NaN,NaN,NaN,9.674,"[35, 18]",NaN,6.85,4623.0,NaN,NaN
tt0112502,Bigfoot,2017,NaN,"Horror,Thriller",NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.10,32.0,NaN,NaN
tt0137204,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy",NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.10,263.0,NaN,NaN
tt0146592,Pál Adrienn,2010,136.0,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.80,451.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
tt9904844,Ott Tänak The Movie,2019,125.0,Documentary,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.70,218.0,NaN,NaN
tt9905412,Ottam,2019,120.0,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.10,505.0,NaN,NaN
tt9905462,Pengalila,2019,111.0,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.40,600.0,NaN,NaN
tt9911774,Padmavyuhathile Abhimanyu,2019,130.0,Drama,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.40,365.0,NaN,NaN
tt9914286,Sokagin Çocuklari,2019,98.0,"Drama,Family",NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.70,136.0,NaN,NaN

### TO DO

Genre ids??

### Dataframe Join - imdb_crew

df5 to df9 - Movie cast/crew assignments + cast/crew info

In [413]:
# we are joining our df5 and df9 to move the cast and crew names with where they have performed

imdb_crew = df5.join(df9, on='nconst', how='inner')
# we lost a few hundred entries (out of over a million) for people listed in IMDB who have never worked on a movie

imdb_crew

            tconst      nconst  category           primary_name  death_year
0        tt0111414   nm0246005     actor           Tommy Dysart         NaN
1        tt0111414   nm0398271  director           Frank Howson         NaN
763031   tt5573596   nm0398271  director           Frank Howson         NaN
2        tt0111414   nm3739909  producer  Barry Porter-Robinson         NaN
3        tt0323808   nm0059247    editor            Sean Barton         NaN
...            ...         ...       ...                    ...         ...
1028178  tt9689618  nm10439724     actor       Phillippe Warner         NaN
1028180  tt9689618  nm10439725  director           Xavi Herrero         NaN
1028183  tt9692684  nm10441594  director              Guy Jones         NaN
1028184  tt9692684   nm6009913    writer        Sabrina Mahfouz         NaN
1028185  tt9692684  nm10441595  producer             Simmer Dim         NaN

[1027912 rows x 5 columns]

### Dataframe Join - box_office
df1 to df3

In [452]:
df1.sort_values('domestic_gross', ascending=False).head(20)

,release_date,production_budget,domestic_gross,worldwide_gross,domestic_net,worldwide_net
movie,,,,,,
Star Wars Ep VII The Force Awakens,2015-12-18,306000000,936662225,2053311220,630662225,1747311220
Avatar,2009-12-18,425000000,760507625,2776345279,335507625,2351345279
Black Panther,2018-02-16,200000000,700059566,1348258224,500059566,1148258224
Avengers Infinity War,2018-04-27,300000000,678815482,2048134200,378815482,1748134200
Jurassic World,2015-06-12,215000000,652270625,1648854864,437270625,1433854864
The Avengers,2012-05-04,225000000,623279547,1517935897,398279547,1292935897
Star Wars Ep VIII The Last Jedi,2017-12-15,317000000,620181382,1316721747,303181382,999721747
Incredibles 2,2018-06-15,200000000,608581744,1242520711,408581744,1042520711
The Dark Knight,2008-07-18,185000000,533720947,1001996207,348720947,816996207
Rogue One A Star Wars Story,2016-12-16,200000000,532177324,1049102856,332177324,849102856
Beauty and the Beast,2017-03-17,160000000,504014165,1259199706,344014165,1099199706
Finding Dory,2016-06-17,200000000,486295561,1021215193,286295561,821215193
Avengers Age of Ultron,2015-05-01,330600000,459005868,1403013963,128405868,1072413963
The Dark Knight Rises,2012-07-20,275000000,448139099,1084439099,173139099,809439099
Shrek 2,2004-05-19,70000000,441226247,937008132,371226247,867008132
Captain Marvel,2019-03-08,175000000,426525952,1123061550,251525952,948061550
The Hunger Games Catching Fire,2013-11-22,130000000,424668047,864868047,294668047,734868047
Pirates of the Caribbean Dead Mans Chest,2006-07-07,225000000,423315812,1066215812,198315812,841215812
Jurassic World Fallen Kingdom,2018-06-22,170000000,417719760,1305772799,247719760,1135772799
Toy Story 3,2010-06-18,200000000,415004880,1068879522,215004880,868879522

In [453]:
df3.sort_values('domestic_gross', ascending=False).head(20)

                               studio  domestic_gross foreign_gross  year
title
Star Wars The Force Awakens        BV     936700000.0       1,131.6  2015
Black Panther                      BV     700100000.0     646900000  2018
Avengers Infinity War              BV     678800000.0       1,369.5  2018
Jurassic World                   Uni.     652300000.0       1,019.4  2015
Marvels The Avengers               BV     623400000.0     895500000  2012
Star Wars The Last Jedi            BV     620200000.0     712400000  2017
Incredibles 2                      BV     608600000.0     634200000  2018
Rogue One A Star Wars Story        BV     532200000.0     523900000  2016
Beauty and the Beast 2017          BV     504000000.0     759500000  2017
Finding Dory                       BV     486300000.0     542300000  2016
Avengers Age of Ultron             BV     459000000.0     946400000  2015
The Dark Knight Rises              WB     448100000.0     636800000  2012
The Hunger Games Catching Fire    LGF     424700000.0     440300000  2013
Jurassic World Fallen Kingdom    Uni.     417700000.0     891800000  2018
Toy Story 3                        BV     415000000.0     652000000  2010
Wonder Woman                       WB     412600000.0     409300000  2017
Iron Man 3                         BV     409000000.0     805800000  2013
Captain America Civil War          BV     408100000.0     745200000  2016
The Hunger Games                  LGF     408000000.0     286400000  2012
Jumanji Welcome to the Jungle    Sony     404500000.0     557600000  2017

In [454]:
box_office = df1.join(df3, how="outer", rsuffix='r')

In [455]:
box_office['dom_gross'] = box_office[['domestic_gross', 'domestic_grossr']].mean(axis=1)
box_office['world_gross'] = box_office[['worldwide_gross', 'foreign_gross']].mean(axis=1)
box_office['dom_net'] = box_office['dom_gross'] - box_office['production_budget']
box_office['world_net'] = box_office['world_gross'] - box_office['production_budget']

In [456]:
box_office.drop(columns=['domestic_gross', 'domestic_grossr', 'worldwide_gross', 'foreign_gross', 'domestic_net', 'worldwide_net'], inplace=True)

In [460]:
box_office.sort_values('dom_gross', ascending=False).head(30)

,release_date,production_budget,studio,year,dom_gross,world_gross,dom_net,world_net
Star Wars The Force Awakens,NaT,NaN,BV,2015.0,936700000.0,NaN,NaN,NaN
Star Wars Ep VII The Force Awakens,2015-12-18,306000000.0,NaN,NaN,936662225.0,2.053311e+09,630662225.0,1.747311e+09
Avatar,2009-12-18,425000000.0,NaN,NaN,760507625.0,2.776345e+09,335507625.0,2.351345e+09
Black Panther,2018-02-16,200000000.0,BV,2018.0,700079783.0,1.348258e+09,500079783.0,1.148258e+09
Avengers Infinity War,2018-04-27,300000000.0,BV,2018.0,678807741.0,2.048134e+09,378807741.0,1.748134e+09
Jurassic World,2015-06-12,215000000.0,Uni.,2015.0,652285312.5,1.648855e+09,437285312.5,1.433855e+09
Marvels The Avengers,NaT,NaN,BV,2012.0,623400000.0,NaN,NaN,NaN
The Avengers,2012-05-04,225000000.0,NaN,NaN,623279547.0,1.517936e+09,398279547.0,1.292936e+09
Star Wars The Last Jedi,NaT,NaN,BV,2017.0,620200000.0,NaN,NaN,NaN
Star Wars Ep VIII The Last Jedi,2017-12-15,317000000.0,NaN,NaN,620181382.0,1.316722e+09,303181382.0,9.997217e+08
Incredibles 2,2018-06-15,200000000.0,BV,2018.0,608590872.0,1.242521e+09,408590872.0,1.042521e+09
The Dark Knight,2008-07-18,185000000.0,NaN,NaN,533720947.0,1.001996e+09,348720947.0,8.169962e+08
Rogue One A Star Wars Story,2016-12-16,200000000.0,BV,2016.0,532188662.0,1.049103e+09,332188662.0,8.491029e+08
Beauty and the Beast,2017-03-17,160000000.0,NaN,NaN,504014165.0,1.259200e+09,344014165.0,1.099200e+09
Beauty and the Beast 2017,NaT,NaN,BV,2017.0,504000000.0,NaN,NaN,NaN
Finding Dory,2016-06-17,200000000.0,BV,2016.0,486297780.5,1.021215e+09,286297780.5,8.212152e+08
Avengers Age of Ultron,2015-05-01,330600000.0,BV,2015.0,459002934.0,1.403014e+09,128402934.0,1.072414e+09
The Dark Knight Rises,2012-07-20,275000000.0,WB,2012.0,448119549.5,1.084439e+09,173119549.5,8.094391e+08
Shrek 2,2004-05-19,70000000.0,NaN,NaN,441226247.0,9.370081e+08,371226247.0,8.670081e+08
Captain Marvel,2019-03-08,175000000.0,NaN,NaN,426525952.0,1.123062e+09,251525952.0,9.480616e+08
The Hunger Games Catching Fire,2013-11-22,130000000.0,LGF,2013.0,424684023.5,8.648680e+08,294684023.5,7.348680e+08
Pirates of the Caribbean Dead Mans Chest,2006-07-07,225000000.0,NaN,NaN,423315812.0,1.066216e+09,198315812.0,8.412158e+08
Jurassic World Fallen Kingdom,2018-06-22,170000000.0,Uni.,2018.0,417709880.0,1.305773e+09,247709880.0,1.135773e+09
Toy Story 3,2010-06-18,200000000.0,BV,2010.0,415002440.0,1.068880e+09,215002440.0,8.688795e+08
Wonder Woman,2017-06-02,150000000.0,WB,2017.0,412581704.0,8.211334e+08,262581704.0,6.711334e+08
Iron Man 3,2013-05-03,200000000.0,BV,2013.0,408996136.0,1.215392e+09,208996136.0,1.015392e+09
Captain America Civil War,2016-05-06,250000000.0,BV,2016.0,408092174.5,1.140069e+09,158092174.5,8.900694e+08
The Hunger Games,2012-03-23,80000000.0,LGF,2012.0,408005346.0,6.779234e+08,328005346.0,5.979234e+08
Jumanji Welcome to the Jungle,2017-12-20,90000000.0,Sony,2017.0,404504458.0,9.644962e+08,314504458.0,8.744962e+08
SpiderMan,2002-05-03,139000000.0,NaN,NaN,403706375.0,8.217064e+08,264706375.0,6.827064e+08

In [466]:
box_office.loc[box_office['production_budget'].isnull()]

,release_date,production_budget,studio,year,dom_gross,world_gross,dom_net,world_net
10 Years,NaT,NaN,Anch.,2012.0,203000.0,NaN,NaN,NaN
1000 Times Good Night,NaT,NaN,FM,2014.0,53900.0,NaN,NaN,NaN
1001 Grams,NaT,NaN,KL,2015.0,11000.0,NaN,NaN,NaN
102 Not Out,NaT,NaN,Sony,2018.0,1300000.0,NaN,NaN,NaN
13 Assassins,NaT,NaN,Magn.,2011.0,803000.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
Z for Zachariah,NaT,NaN,RAtt.,2015.0,121000.0,NaN,NaN,NaN
Zero Motivation,NaT,NaN,Zeit.,2014.0,116000.0,NaN,NaN,NaN
Zindagi Na Milegi Dobara,NaT,NaN,Eros,2011.0,3100000.0,NaN,NaN,NaN
Zombeavers,NaT,NaN,Free,2015.0,14900.0,NaN,NaN,NaN
xXx The Return of Xander Cage,NaT,NaN,Par.,2017.0,44900000.0,NaN,NaN,NaN

## TO DO

We need to change up our tmdb dataset, even though it means re-running our API page. The IMDB data is only for the last 10 years, so we should pull consistent data from TMDB to match it.